[
  {
    "library": "Boost",
    "entries": [
      {
        "library_name": "Boost",
        "url": "https://www.boost.org/users/history/version_1_88_0.html",
        "version": "version_1_88_0.html",
        "title": "Boost 1.88.0",
        "release_date": "Unknown release date",
        "content": "Version 1.88.0 April 10th, 2025 20:39 GMT Documentation New Libraries Hash2: An extensible hashing framework, from Peter Dimov and Christian Mazakas. MQTT5: client library built on top of Boost.Asio, from Ivica Siladić, Bruno Iljazović, and Korina Šimičević. Updated Libraries Array: Converted documentation to AsciiDoc (Christian Mazakas). Added noexcept and constexpr as appropriate. Marked obsolete functions as deprecated. Removed obsolete compiler workarounds. Changed array<T, 0>::begin(), cbegin(), end(), cend() to return nullptr, enabling constexpr. This matches the behavior of std::array. Removed local hash_value overload; boost::hash supports array-like types natively. array<T, 0> can now be initialized with = {{}}. Added operator<=>. Added to_array. Asio: Added noexcept qualifiers to various local::basic_endpoint member functions, to make it consistent with ip::basic_endpoint. Fixed the boost::asio::config class's handling of integer values. Fixed a use-after-move error in experimental::ranged_parallel_group. Fixed an incorrect default template argument in the implementation of experimental::promise. Fixed the io_uring implementation so that it does not attempt to re-register internal descriptors with the reactor after a fork, if they were not previously registered. Fixed an uninitialised member in the thread_pool default constructor. Fixed an ambiguous overload issue that occurred when passing a std::span to the boost::asio::buffer function. Removed some spurious macro definitions that were left after the removal of deprecated buffer functionality. Added documentation to clarify the use of file_base::flags when opening a file. Added overview documentation on the available runtime configuration options. Updated the overview documentation to reflect the use of deferred as the default completion token. Updated the async_result documentation to reflect the current type requirements placed on specialisations of the trait. Assert: When BOOST_ASSERT_HANDLER_IS_NORETURN is defined, boost::assertion_failed and boost::assertion_failed_msg are declared as BOOST_NORETURN. Beast: Fixes Fixed out-of-bounds access in iequals function. Improvements Updated SSL examples to verify peer certificate hostname. Refactored CMakeLists. Removed Boost.Scope dependency from examples. Peer pings in WebSocket now count as activity. Documentation Added new examples for Unix domain sockets. Added SSL/TLS Certificate section to documentation. Improved documentation of websocket::stream::async_close. Acknowledgements Morten M. Neergaard Conversion: Use modern C++ in the samples and in the library code. DLL: Added constructor from native_handle_t to the boost::dll::shared_library. Many thanks to Tiago Matos for the PR#82. Dropped multiple dependencies on other Boost libraries including Spirit, SmartPtr, Move, TypeTraits, and Function. DLL became more lightweight for compilation. std::error_code& in API is used instead of the boost::system::error_code&. This is not a breaking change as boost::system::error_code is convertible to std::error_code&. boost::dll:import_* functions now return std::shared_ptr rather than boost::shared_ptr. Define BOOST_DLL_USE_BOOST_SHARED_PTR to restore the old behavior, however note that the macro will be removed in one of the upcomming Boost releases. Use modern C++ in the samples and in the library code. boost::dll::library_info now always throws in case of a broken binary. Updated the docs and added some tests. Documented in FAQ why RTLD_NODELETE is missing and why there is no .release() method. Provided suggestions on possible workarounds. Updated the information on building and using the library. CMake targets now link with -ldl if it is required by the platform. Fixed detail::path_from_handle implementation for long paths on Windows OS. Highlighted in the docs that boost/dll/smart_* parts of the library are experimental and incomplete. Fixed multiple mangling issues in boost/dll/smart_* parts of the library. Geometry: Improvements PR#1370 Relax half period check in spheroidal normalization PR#1368 Pass umbrella strategies in rtree spatial predicates PR#1367 Improvements in traversal PR#1361 Test set operations on random grids with integer coordinates Several test cases has been added Use using instead of typedef in part of the code Solved issues PR#1364 Fix several strategies (add getters, fix compilation error and warning) #629 Avoid warnings for coordinate conversions and unused parameters Various fixes of errors and warnings Graph: Bug fixes Replace implementation of maximum_weighted_matching, resolves multiple issues. Ensure named_graph is initialized before use. Replace custom geometry code in is_straight_line_drawing with Boost.Geometry, fixes incorrect results for very small angles. Fix incorrect callbacks to finish_edge in undirected_dfs. Performance improvements adjacency_list: Remove unnecessary calls to resize/reserve from within add_vertex for vector-based storage! A quick benchmark indicates a 10% improvement to graph construction time. lengauer_tarjan_dominator_tree: Replace std::deque with std::vector, obtaining a ~40% improvement for large graphs. General Improvements Replace the use of several Boost utilities with C++14 language features. Modernize examples with C++14 language features. Various fixes to documentation and build system. vertex_by_property no longer requires a mutable graph. Fix compilation issue with cycle_canceling and Clang 19. Iterator: Dropped support for C++03 and ancient compilers, updated code base to use C++11 and MP11, reduced usage of MPL. (PR#82) Added min_category trait, which is a variadic equivalent of minimum_category that doesn't depend on MPL. minimum_category is deprecated and will be removed in a future release. Extracted enable_if_convertible trait to a separate header enable_if_convertible.hpp. The trait was previously defined in iterator_adaptor.hpp, and the header still provides enable_if_convertible when included. This dependency is provided for backward compatibility and will be removed in a future release. Users are advised to add includes of enable_if_convertible.hpp, as needed. Added *_t variants of various iterator traits that produce types. filter_iterator and transform_iterator now use empty base optimization (EBO) to reduce size of the iterator when the adopted function object is stateless. zip_iterator now natively supports boost::tuple, std::tuple and std::pair for iterator tuples and doesn't need including Fusion support headers. function_output_iterator no longer allows default construction when the wrapped function is a function pointer. Such construction would previously create an iterator with an uninitialized function pointer value, and such an iterator would be unusable. generator_iterator.hpp and shared_container_iterator.hpp headers were moved under the boost/iterator directory. The previous headers in boost are still retained for backward compatibility, but will be removed in a future release. Users are advised to update their includes. shared_container_iterator now uses std::shared_ptr to reference the container internally. The support for boost::shared_ptr is still retained, but it will incur performance overhead on the iterator construction, as boost::shared_ptr is now wrapped in a std::shared_ptr internally. It is recommended to use std::shared_ptr to reference the container. Locale: Raised required ICU version to at least 4.8.1 Dropped support for ICU 50.1 Fixed parsing of integers with input strings in floating point format (PR#241) Support parsing and formatting of uint64_t values with the ICU backend (PR#246) Support char8_t on more platforms Lockfree: Added new spsc_value, a lockfree single-producer single-consumer value based on a triple-buffer Log: Disabled usage of std::codecvt<char16_t> and std::codecvt<char32_t> locale facets in C++20 and later modes as they were deprecated in C++20. This means character code conversions to/from char16_t and char32_t is no longer available in C++20 and later. Fixed building issues when using CMake and MinGW-w64. (PR#241) Fixed incorrect file counter used by text_file_backend when the backend was configured to append to an existing file and the actively written file name pattern didn't have a counter placeholder but the target file name pattern did, and the log files were written directly into the target storage. (#245) Mp11: Fixed mp_from_sequence for non-integral values (accidentally broken in 1.83.0 due to offset support) MySQL: connection_pool now resizes correctly even in the presence of many connections with session establishment in-progress. The old algorithm could lead to the pool not being resized as expected under certain conditions (#395). Added any_connection::connection_id. This function retrieves the connection's ID, which can subsequently be used in KILL SQL statements to cancel queries. This function is equivalent to mysql_thread_id in the official C API (#408) Attempting to start an async operation on a connection or any_connection while another operation is in-progress no longer triggers undefined behavior. It now fails with client_errc::operation_in_progress (#405). Attempting to start an operation while a connection or any_connection are engaged in a multi-function operation no longer yields potentially dangerous packet mismatches. It instead fails with client_errc::engaged_in_multi_function (#448). Improved diagnostics when attempting to use a connection without a established session. Operations now fail with client_errc::not_connected (#450). Fixed a race condition in connection and any_connection regarding per-operation cancellation. In previous versions, if a cancellation signal was emitted after an intermediate async operation had completed, but before its handler had been called, the signal was ignored. This is no longer the case (#199). field's constructor and assignment from std::string_view are now available in C++17, rather than C++20. These functions were guarded by standard feature-test macros, only available in C++20. These have been replaced by their Boost.Config equivalents. Added an HTTP server example that uses C++20 coroutines. Added a doc page on interfacing sync and async code. This replaces the synchronous connection pool snippet, which contained a race condition. Improved some of the other examples and doc pages. Nowide: Make getenv thread-safe (PR#191) PolyCollection: Added boost::variant_collection, a closed polymorphic collection similar in behavior to std::vector<std::variant<...>>. SmartPtr: Fix operator<< for wide streams (accidentally broken in 1.87.0) Stacktrace: Use GetModuleNames to determine the full module path for MSVC implementation. Many thanks to Daniel Krügler for the PR#198. Print relative addresses to allow their decoding later without knowing the base address. The logic could be disabled by defining BOOST_STACKTRACE_DISABLE_OFFSET_ADDR_BASE. Many thanks to Maciej Czarnecki for the PR#200. Expose all the stacktrace libraries as b2 features for better control over the build and explicit information on what libraries are built. See \"Configuration and Build\" section for more info. Many thanks to Uilian Ries for initial implementation of the feature in PR#202. Fixed stacktrace_from_exception builds with MinGW. Thanks to crhilton for the fix. TypeIndex: Fixed an UB that was introduced in Boost.TypeIndex 1.84 and prevented the library from building on clang-20. Unordered: Migrated the documentation to a multipage format using Antora. Variant2: Use the smallest appropriate unsigned type for the index. Compilers Tested Boost's primary test compilers are: Linux: Clang, C++03: 3.4, 3.5, 3.6, 3.7, 3.8, 3.9, 12.0.0, 13.0.0, 14.0.0, 15.0.0 Clang, C++11: 3.4, 11.0.0, 13.0.0, 14.0.0, 15.0.0 Clang, C++14: 3.5, 3.6, 3.7, 3.8, 3.9, 4.0, 5.0, 12.0.0, 13.0.0, 14.0.0, 15.0.0 Clang, C++17: 6.0.1, 7.0.0, 8.0.0, 9.0.0, 10.0.0, 11.0.0, 12.0.0, 13.0.0, 14.0.0, 15.0.0 Clang, C++20: 11.0.0, 12.0.0, 13.0.0, 14.0.0, 15.0.0 GCC, C++03: 4.6.3, 11, 12 GCC, C++11: 4.7.3, 4.8.5, 11, 12 GCC, C++14: 5.4.0, 6.4.0, 7.3.0, 8.0.1, 9.1.0, 11, 12 GCC, C++17: 7.3.0, 8.0.1, 9.1.0, 11, 12 GCC, C++20: 8.0.1, 9.1.0, 10, 11, 12 OS X: Apple Clang, C++03: 11.0.3 Apple Clang, C++11: 11.0.3 Apple Clang, C++14: 11.0.3 Apple Clang, C++17: 11.0.3 Apple Clang, C++20: 11.0.3 Windows: Visual C++: 10.0, 11.0, 12.0, 14.0, 14.1, 14.2, 14.3 Acknowledgements Marshall Clow, Glen Fernandes and Ion Gaztañaga managed this release.",
        "crawl_status": "success"
      },
      {
        "library_name": "Boost",
        "url": "https://www.boost.org/users/history/version_1_85_0.html",
        "version": "version_1_85_0.html",
        "title": "Boost 1.85.0",
        "release_date": "Unknown release date",
        "content": "Version 1.85.0 April 15th, 2024 17:38 GMT Documentation Known Issues These are patches from library authors which were found too late to be fixed in the release. Container flat_map/multimap containers can crash or return invalid results in some compilers due to UB in the library, see #273. Patch. New Libraries Charconv: A high quality implementation of <charconv> in C++11, from Matt Borland. Scope: A collection of scope guard utilities and a unique_resource wrapper, from Andrey Semashev. Updated Libraries Asio: Fixed the async_result primary template's concept checking to correctly handle lvalue-qualified completion signatures. Fixed some compile errors that could arise when using the bind_allocator, bind_executor, bind_immediate_executor and bind_cancellation_slot completion token adapters to adapt each other. Changed the experimental::ranged_parallel_group operation so that it moves the completion_order vector when invoking the completion handler. Fixed some warnings about deprecated implicit copy constructors on ip::basic_resolver_query, io_context::strand, and coroutine. Updated the version specification used to initialise Winsock. Fixed co_spawn to correctly propagate exceptions resulting from cancellation to the completion handler. Added calls to std::launder to fix undefined behaviour in awaitable<> internal storage. Added missing handling of the file_base::append flag in the Windows implementation of file support. Updated the socket and descriptor implementations to add more cases where they will fall back to fcntl if a call to ioctl fails. Fixed the boost/asio/experimental/parallel_group.hpp header so that it is self-contained. Fixed a compile error that occurred when channels and experimental::coro were both used in the same translation unit. Added missing CancellationSlot type requirements to documentation. Fixed the documentation hyperlinks for the deduced return types of asynchronous operations' initiating functions. Other minor documentation updates. Atomic: Added support for pause instruction on RISC-V. (PR#65) Beast: API Changes The status code list has been updated to conform with the IANA registry. Fixes Unreachable code warning in buffers_cat.hpp. Connection error handling in websocker_server_awaitable example. Concurrent calls to async_write in advanced server examples. zlib name conflicts with minizip. host string should be updated after SSL_set_tlsext_host_name(). Improvements asio::associator is specialized for bind_wrapper and bind_front_wrapper. Add non-allocating overload for error category message function. Documentation Specifies when calling http::message::prepare_payload() is optional. Operations affected by basic_stream::expires_after(). teardown() and async_teardown() are customization points. Moving or copying http::serializer after first usage is undefined behaviour. websocket::permessage_deflate should be configured before performing the WebSocket handshake. bytes_transferred in http reads operations reports the number of bytes consumed by the HTTP parser. Acknowledgements Emile Cormier, JohannesWilde, yhzx233 Bimap: Fixed heterogeneous lookup for side collections (PR#42). Bind: C++03 is no longer supported; a C++11 compiler is required. (This includes GCC 4.7 or later, and MSVC 12.0 (VS 2013) or later.) Conversion: Removed outdated mentions of boost::lexical_cast that is not part of the library any more. Thanks to Danil Sidoruk for the PR PR#28! Core: Added a new boost/core/functor.hpp header with a functor class template for wrapping a raw function into a function object class. Changed null_deleter, fclose_deleter and checked deleter definitions so that they don't bring namespace boost into argument-dependent lookup. Users may need to either explicitly qualify the namespace of the called function or add a using-declaration. Filesystem: path::generic_path and path::generic_string methods now remove duplicate directory separators in the returned paths. v4: path::generic_path, path::generic_string, path::make_preferred and path::lexically_normal avoid converting between backslashes and forward slashes in path root names. For example, on Windows, path(\"\\\\\\\\\\\\\\\\?\\\\\\\\c:\\\\\\\\foo\").generic_string() now returns \"\\\\?\\c:/foo\" instead of \"//?/c:/foo\". Similarly, path(\"\\\\\\\\\\\\\\\\host/share/foo/..\").lexically_normal() now returns \"\\\\host\\share\". v4: equivalent now indicates error if either one of the paths doesn't exist. v4: absolute now returns a path with a trailing directory separator when the input path has an empty relative_path(). (#301) Added a unique_path overload taking a single error_code& ec argument. The overload generates a unique path using the default path model. weakly_canonical now produces an absolute path if the input path is relative and contains no elements that exist in the filesystem. (#300) Added a new copy_options::ignore_attribute_errors option for copy_file and copy operations. The new option allows to ignore possible errors while copying file attributes. (#179) On Linux, copy_file backends based on sendfile and copy_file_range system calls will attempt to preallocate storage for the target file. This may reduce filesystem fragmentation and provide early error indication if there is not enough free space. Not all filesystems support this feature; file copying proceeds if storage preallocation is not supported. On POSIX systems that support fdopendir, openat and related APIs defined in POSIX.1-2008, as well as on Windows, recursive_directory_iterator now uses file descriptors/handles instead of paths to query the file statuses and open nested directories during iteration. This makes directory iteration more resilient to concurrent modifications of the filesystem. Removed APIs that were previously declared deprecated. In particular, path and recursive_directory_iterator member functions, is_regular, copy_directory, symbolic_link_exists, complete, copy_option, symlink_option, as well as boost/filesystem/convenience.hpp and boost/filesystem/path_traits.hpp headers were removed. Possible replacements for the removed components are mentioned in the documentation. Support for path construction, assignment and appending from container types (e.g. std::vector<char>) is now disabled by default. Users can still enable this functionality by defining BOOST_FILESYSTEM_DEPRECATED. This functionality remains deprecated and will be completely removed in a future release. Function: C++03 is no longer supported; a C++11 compiler is required. (This includes GCC 4.7 or later, and MSVC 12.0 (VS 2013) or later.) Geometry: Improvements PR#1247 Use if constexpr macro instead of condition macro PR#1242 Pass strategy to sort by side PR#1234 Add cmake files for clang/mac/darwin/arm64 Solved issues #1231, #1244 Fix invalid set operations for CCW polygons #1259 Fix compilation error with CUDA NVCC compiler #1250 Fix buffer of linestring returning incorrect inner polygon #1230 Fix union operation perturbing a point and returning wrong result #1229 Fix union producing self intersections PR#1248 Fix buffer issue by setting turns in closed clusters as non traversable PR#1246 Fix compilation of converter and is_base_of Various fixes of errors and warnings Iterator: Support for C++03 is deprecated and will be removed in a future release. JSON: Boost.Endian is now used to deal with endianness. Aliases to Boost.System and Boost.Container components are deprecated and will be completely removed in 1.87.0. Conversion of described classes supports private members. Rvalue reference overload for visit. Add conversion support for path-like types. Parsing into described classes correctly considers inherited members. Conversion of self-referential sequences is disabled. Fixed reference handling in visit. LEAF: New API for transporting of error objects and exceptions between threads: try_capture_all. result<T> able to transport exceptions captured via try_capture_all. result<T> transporting dynamically captured error objects with improved efficiency. Old make_shared_context/capture APIs are deprecated, will be removed in the next release. Removed support for transporting of dynamicaly captured error objects in exceptions. LexicalCast: Significant rewrite of the internal logic to separate optimized and C++ Standard Library IO-based streams: C++ Standard Library based streams now constructed in less cases leading to better performance; less template instantiations and simpler code; always use std::char_traits (do not use custom traits from input/output types as it leads to linktime or runtime errors); fixed missuse of forward declared boost::array (thanks to 13steinj for the report #64!); support for volatile input types was dropped, following the C++ Standard Library trend. Optimized conversions from std::basic_string_view and boost::basic_string_view #30. Dropped dependency on Boost.NumericConversion and Boost.MPL. Fixed some cases of converting floting point types to arithmetics. The library now compiles and works fine with -fno-sanitize-recover=integer #45. Locale: Fix linker issues due to missing typeinfo for char8_t in C++20 mode Fix IConv compile flags when using ICU that has a bundled IConv collator now throws on construction, if at all, as documented collator no longer derives from std::collator to avoid possible type confusing when it isn't available for the current backend PR#216 Throw an exception when a faulty IConv library is detected (e.g. on some MacOS versions) instead of looping indefinitely PR#218 Reduce resolution of date_time to seconds as milliseconds where not easily available causing confusion #221 Math: Added a new collection of optimization algorithms: Differential Evolution PR#1062 JSO PR#1065 Random Search PR#1071 CMA-ES PR#1074 Fix Divide by 0 warning in NCF survival function Fix constexpr depth limits of ccmath::floor/ceil fail for large arguments Improve accuracy of quartic_roots Fix cstdfloat numeric limits detection macro for libstdc++14 Fix for MSVC UCRT defining _Complex_I in complex.h when using C++14 PR#1060 Improve cstdfloat iostream PR#1066 Fix redefnition of Boost.Config macros when using standalone mode in a non-standalone environment Significant improvements to code coverage with associated bug fixes MSM: Major Update. Backend update (back11). Requires C++ 11. The documentation now uses it as default. Big new feature. New front-end (PlantUML). Requires C++ 20 Various Bugfixes (compiler errors and warnings, priority of deferred events) Multi-index Containers: Fixed documentation errors. Multiprecision: Fix deprecation warnings from C++23 <limits> PR#575 Fix cpp_bin_float for small bit counts PR#577 Fix -Wpessimizing-move PR#580 Add covecov runs Reduce truncation in cpp_dec_float multiplication PR#585 Fix complex_adaptor to match precision requirements PR#597 Fix for breaking changes in tommath PR#603 Fix for types that can be converted to number participting in arithmetic operator overloads #608 MySQL: Breaking change: Boost.MySQL now requires linking to the new Boost.Charconv compiled library. This addresses a locale-dependency problem, increases efficiency, and powers the new client-side SQL formatting feature. Added experimental support for connection pools, which allows re-using sessions and provides built-in reconnection and error handling. Added experimental support for type-erased connections (any_connection class). any_connection is not a template and features simpler connection establishment and reconnection semantics. Added experimental support for client-side SQL formatting functions (format_sql and format_sql_to). These allow securely composing queries client-side, which enables patterns like batch inserts, dynamic filters or PATCH-like updates. Fixed a performance issue affecting close_statement and async_close_statement that could cause significant delays in application code. Added support for building with BOOST_ASIO_USE_TS_EXECUTOR_AS_DEFAULT. The deprecated execution interface (connection::query, connection::start_query, connection::execute_statement, connection::start_statement_execution and their async counterparts) now triggers warnings, as it's scheduled for removal in Boost 1.86. Fixed a bug that caused some error messages to be truncated. Warning cleanup. Builds are now clean from warnings when building with -Wall and -Wextra. All field_view constructors are now stable. The library internals have been rewritten using a sans-io approach to reduce complexity. Odeint: Breaking change: The library now explicitly requires C++14 instead of implicitly by including Boost.Math Fix compatibility with Thrust 1.10.0 Removed C++03 Boost components: Array Bind Function Static_assert PFR: boost::pfr::get_name now can work with local types on some compilers. Thanks to Bela Schaum for the PR PR#152! Removed unused implementation details. Thanks to Denis Mikhailov for the PR PR#154. Allow throwing exceptions from boost::pfr::structure_to_tuple. Thanks to Denis Mikhailov for the bug report #155. Field reflection trick is now described in the docs. Thanks to all the discussion participans in #150! Random: Added splitmix64 PRNG PR#89 System: C++03 is no longer supported; a C++11 compiler is required. (This includes GCC 4.8 or later, and MSVC 14.0 (VS 2015) or later.) The deprecated header boost/system/cygwin_error.hpp has been removed. The original and obsolete (32 bit) MinGW is no longer supported. MinGW-w64 (both 64 and 32 bit) is still supported. operator& now works for result<void> (by way of taking a nullary function.) Added operator|= for result. Stacktrace: Big new feature: stacktrace from arbitrary exception. On some POSIX platforms std::stacktrace::from_current_exception() now returns the stacktrace of the current exception object as if the stacktrace was captures at the point of throwing the exception. Many thanks to Andrei Nekrashevich for prototyping the idea in libsfe. Fixed memory consumption on Windows with boost_stacktrace_windbg. Thanks to ycyclop for reporting the issue #111, to Thiago A. Correa for providing more information, to Andrei Karpovskii for providing a possible fix. Fixed library build with non hidden visibility. Thanks to Jan Bouwer for the report and information on how to fix it. Added a separate section on async signal safety to the docs. Many thanks to tworonix for highlighting the problem in #131 and to itrofimow for information on the problem. STLInterfaces: Change the behavior of iterator_interface for input iterators in C++20 and later, to more closely follow the C++20 concepts. Remove hidden friends from iterator_interface to fix errors about concepts being redefined with different constraints. Add a new v3 inline namespace, containing a new iterator_interface based on deducing this instead of CRTP (C++23 and later). Add an rvalue-qualified overload of closure::operator(), to prevent dangling temporaries. Test: Respect library-spcific _NO_LIB macros PR#406 Supress MSVC C4702 from __builtin_unreachable() on intentionally unreachable code Fix boost::function streaming error PR#411 Unordered: Optimized emplace() for a value_type or init_type (if applicable) argument to bypass creating an intermediate object. The argument is already the same type as the would-be intermediate object. Optimized emplace() for k,v arguments on map containers to delay constructing the object until it is certain that an element should be inserted. This optimization happens when the map’s key_type is move constructible or when the k argument is a key_type. Fixed support for allocators with explicit copy constructors (PR#234). Fixed bug in the const version of unordered_multimap::find(k, hash, eq) (PR#238). Variant: Removed more of the pre-C++11 macro and workarounds. Wave: Fixed bugs: #200: Emitted pragmas lack terminating newline #202: YYMARKER not updated when fill called on BOOST_WAVE_BSIZE boundary Updated Tools Build: Includes release of B2 version 5.1.0. Compilers Tested Boost's primary test compilers are: Linux: Clang, C++03: 3.4, 3.5, 3.6, 3.7, 3.8, 3.9, 12.0.0, 13.0.0, 14.0.0, 15.0.0 Clang, C++11: 3.4, 11.0.0, 13.0.0, 14.0.0, 15.0.0 Clang, C++14: 3.5, 3.6, 3.7, 3.8, 3.9, 4.0, 5.0, 12.0.0, 13.0.0, 14.0.0, 15.0.0 Clang, C++17: 6.0.1, 7.0.0, 8.0.0, 9.0.0, 10.0.0, 11.0.0, 12.0.0, 13.0.0, 14.0.0, 15.0.0 Clang, C++20: 11.0.0, 12.0.0, 13.0.0, 14.0.0, 15.0.0 GCC, C++03: 4.6.3, 11, 12 GCC, C++11: 4.7.3, 4.8.5, 11, 12 GCC, C++14: 5.4.0, 6.4.0, 7.3.0, 8.0.1, 9.1.0, 11, 12 GCC, C++17: 7.3.0, 8.0.1, 9.1.0, 11, 12 GCC, C++20: 8.0.1, 9.1.0, 10, 11, 12 OS X: Apple Clang, C++03: 11.0.3 Apple Clang, C++11: 11.0.3 Apple Clang, C++14: 11.0.3 Apple Clang, C++17: 11.0.3 Apple Clang, C++20: 11.0.3 Windows: Visual C++: 10.0, 11.0, 12.0, 14.0, 14.1, 14.2, 14.3 Acknowledgements Marshall Clow and Glen Fernandes managed this release.",
        "crawl_status": "success"
      },
      {
        "library_name": "Boost",
        "url": "https://www.boost.org/users/history/version_1_82_0.html",
        "version": "version_1_82_0.html",
        "title": "Boost 1.82.0",
        "release_date": "Unknown release date",
        "content": "Version 1.82.0 April 14th, 2023 03:08 GMT Documentation Known Issues These are patches from library authors which were found too late to be fixed in the release. Filesystem Compilation on OpenBSD may fail because of broken support for -Wl,--no-undefined compiler flag for shared libraries on this platform, see #283. Patch. On Windows, creating directory iterators over directories in SMBv1 shares may fail with ERROR_INVALID_LEVEL error code, see #284. Patch. Notice of Dropping C++03 Support The following libraries will be dropping C++03 support in release 1.84, two releases from now: Align Any Asio Atomic Bind Chrono ContainerHash Conversion DLL Endian Filesystem Function Functional Io LexicalCast Log Random Ratio SmartPtr System Stacktrace Thread Timer TypeIndex Typeof Unordered Variant This release (1.82) and the next (1.83) will be the last releases offering C++03 support for the above libraries and most of their dependencies. The new baseline requirement for the above libraries, and for most of Boost, will be C++11. Since old compiler versions often implement C++11 only partially, due to missing support or bugs, what compilers are considered to meet the C++11 requirement may vary by library. However, a general rule is that if a compiler does not recognize a C++11 keyword or syntax at all (e.g. use of noexcept, use of constexpr, or defining a =deleted function results in an immediate compile error), or if a compiler does not provide a required C++11 header at all (e.g. trying to include <atomic> or <chrono> fails), or the compiler provides a C++11 feature or a header that is completely unusable, this compiler is not considered a C++11 compiler. This rules out, for instance, Microsoft Visual C++ before 14.0, or GCC before 4.8. New Libraries Mysql: a C++11 client for the MySQL database server, based on Boost.Asio, from Ruben Perez. Updated Libraries Any: Now uses core/enable_if.hpp header instead of the deprecated utility/enable_if.hpp. Thanks to Michael Ford for the PR PR#25. Asio: Added the ability to customise the execution of a completion handler when an operation completes immediately. Added user-defined literals for buffer types. Added a new protocol type local::seq_packet_protocol to represent AF_UNIX with SOCK_SEQPACKET. Exposed sigaction() flags via an optional argument to signal_set::add. Change allocator_binder, executor_binder, and cancellation_slot_binder to support detection of unspecialised associators. Fixed ambiguity in associated_cancellation_slot<reference_wrapper>::get(). Fixed awaitable<> handling for completion signatures containing std::exception_ptr. Fixed experimental::channel<> try_send failure after a cancel. Fixed thread_pool::join() deadlock when the pool has no internal threads. Fixed pipe release() when using io_uring. Fixed data initialisation and cleanup issues in the io_uring backend. Fixed a dangling reference issue in the execution context overload of get_associated_executor(). Ensured buffered messages can still be received when an experimental::channel<> is closed. Fixed the any_completion_handler assignment operator. Constrained the constructor of any_completion_handler to prevent accidental copying Changed to use uint64_t for OpenSSL options, to match OpenSSL 3. Fixed deferred interoperability with multiple completion signatures. Fixed channels to add partial support for C++11 and C++14. Added missing handler tracking source location support to co_composed and 'awaitable<>' coroutines, when awaiting packaged asynchronous operations. Fixed some 'potential null dereference' and shadow variable warnings. Fixed a asio::buffer overload selection when used with const_buffers_1 and mutable_buffers_1. Disabled the runtime check for current Windows version unless targeting older Windows. Fixed compatibility between buffered stream wrappers and move-constructible streams, such as ssl::stream<>. Fixed basic_socket_acceptor::async_accept compatibility with lambdas that have a deduced return type. Fixed as_tuple compatibility with legacy completion tokens. Fixed redirect_error compatibility with new completion tokens. Fixed a potential, Windows-specific program termination due to exceptions that should have been allowed to escape from a destructor. Prevented inadvertent co_await of boolean expressions. Fixed result handling and support for custom allocators in experimental::use_coro. Fixed variadic template emulation for is_async_operation and completion_signature_of. Fixed incorrect reuse of a moved-from result in experimental::promise. Fixed experimental::coro use with custom allocators. Fixed seek_cur behaviour with stream-oriented files on Windows. Various additions and modifications to the documentation. Consult the Revision History for further details. Atomic: When compiled for x86 targets supporting AVX, vector instructions are now used for 128-bit atomic loads and stores. For 32-bit x86 targets, 64-bit atomic loads and stores with memory_order_seq_cst semantics will now issue a memory ordering instruction. Removed atomic<T>::storage() accessors and atomic<T>::storage_type types that were deprecated in Boost.Atomic 1.73. Users are recommended to use atomic<T>::value() and atomic<T>::value_type instead. Beast: Add error_codes use source_location tcp_stream uses the correct executor of the timer. error_categories use numeric ids file_body supports seek ContainerHash: Added an overload of hash_value for std::nullptr_t. Added is_tuple_like and an overload of hash_value for tuple-like types. Changed string hashing to use mulxp1_hash. This improves both quality and speed. Core: Added boost/core/snprintf.hpp header with portable definitions of snprintf, vsnprintf and their wchar_t counterparts. Deprecated boost/core/is_same.hpp and boost::core::is_same. The header will be removed in a future release. Users are advised to use Boost.TypeTraits or C++ standard library type traits instead. Marked boost::ref member functions and associated methods with noexcept. Marked boost::swap function with noexcept, depending on whether the type supports a non-throwing swap operation. Added boost::core::launder, a portable implementation of std::launder. Added BOOST_CORE_ALIGNOF, a portable implementation of alignof. Added boost::core::max_align_t, a portable equivalent of std::max_align_t, and boost::core::max_align, the alignment of max_align_t. Added boost::core::memory_resource, a portable equivalent of std::pmr::memory_resource from C++17. Added boost/core/serialization.hpp, a collection of primitives allowing libraries to implement Boost.Serialization support for their types without including a Serialization header and thereby making their libraries depend on Serialization. Added boost::data, an implementation of std::data. Added boost::size, an implementation of std::size. Updated boost::span to use boost::data which adds support for range construction from an std::initializer_list. Added boost::identity, an implementation of std::identity. This facility has been moved from Boost.Functional. DLL: Avoid implicit cast from size_t to uint32_t, thanks to Travers Biddle for the PR PR#57. Filesystem: Fixed compilation errors that could have been caused by path conversion constructors being too permissive on the accepted arguments. (#273) v4: path::remove_filename now presesrves the trailing directory separator. (#271) Added path::remove_filename_and_trailing_separators, which removes the filename and directory separators preceding it from the path. This behavior is similar to path::remove_filename in Filesystem v3, but is also usable in v4. Added path::replace_filename, which replaces filename in a path. Updated implementation of the library version selection to avoid ODR violations. (#279) On Windows, added a workaround for querying file attributes for files in SMBv1 shares. Previously, directories in SMBv1 shares could have been reported as regular files. This does not affect SMBv2 or later. (#282) Geometry: Major improvements PR#1045 Support geographic buffer for (multi)linestrings and (multi)polygons Improvements PR#1114 Comparable distance: Add support for dynamic geometries PR#1046 Support covered_by() for box, geometry combinations Solved issues #705 WKT: allow tabs and new lines #1109, #1108 Fixes for union Various fixes in examples Breaking changes The WKT output presentation of an empty polygon is now POLYGON() to make it consistent with other geometries Histogram: Replace detail::span and detail::make_span with implementations in boost::core Documentation improvements Protect usage of std::min and std::max in some cases, contributed by Han Jiang (min,max macros are illegially set by popular Windows headers so we need to work around) Added test to catch usage of unprotected min,max tokens in the library in the future Fixes to support latest clang-14 and deduction guides in gcc-11+ JSON: set_at_pointer. boost::hash support. Caller-provided serializer storage. value_to supports missing elements for std::optional. Fix parser suspend inside an escape character. Make sentinel() return a unique pointer. Locale: get_system_locale and dependents will now correctly favor LC_ALL over LC_CTYPE as defined by POSIX PR#144 utf8_codecvt::out returns partial for trailing (UTF) surrogates Add boost::locale::util::locale_data to parse a locale boost::locale::info::encoding() result is now in uppercase as documented, e.g. UTF-8 instead of utf-8 Support M49 country codes such as en_001 or en_150 PR#148 Treat en_US_POSIX as an alias for the C locale PR#148 Improve error for missing segmentation support (i.e. without ICU) PR#149 Fix compiler warnings Math: Deprecated C++11 support: We now require C++14 as a minimum standard. Our minimum tested compiler versions are now Clang-5, GCC-5 or MSVC-14.1. Added Estrin's method for polynomial evaluation. Fix various issues in non-central distributions to allow for larger non-centralities see 939. Added CMake install target. Fix special_functions.hpp to disable anything which can't be used in an exception-free environment. Get condition number calculation working in C++14. Fix constexpr table driven functions to avoid massive slowdown when the code is not actually constexpr, see 923. Improve tanh_sinh boundary handling, see 894. Add Linux arm64, s390x and Apple M1 testing, fix up test cases to handle 128-bit long doubles. Improve constexpr math functions to better handle infinities and NaN's. Make the integrators const-correct. Fix tanh_sinh integrator in case the function underflows, see 898. Don't use std::cbrt as some platforms still don't support it. Stop non-central T from raising spurious FE_INVALID exceptions, see 892. Fix binomial distribution edge case. Improve ibeta handling of very small arguments, see 884. Improve ibeta handling of infinities and NaN's, see 878. Improve error handling in powm1, see 781. Improve root-finder bracketing to bracket faster when the exponent is super-large or small. Fix root finding edge cases, see 873. Lots of miscellaneous warning fixes. Add assertions when using features which require C++17 for better error messages when invoking the compiler in a lower std version. Multi-index Containers: Serialization now uses unsigned long instead of collection_size_type, and multi_index_container serialization class version has been bumped from 2 to 3 to reflect this change. Reading old archives may fail for custom archive types giving special treatment to collection_size_type values: if this is the case, globally define the macro BOOST_MULTI_INDEX_ENABLE_SERIALIZATION_COMPATIBILITY_V2 to ensure backwards compatibility in reading operations. Maintenance work. Multiprecision: Deprecated C++11 support: We now require C++14 as a minimum standard. Our minimum tested compiler versions are now Clang-5, GCC-5 or MSVC-14.1. Added a new forward declaration header. Update Eigen interoperability so we no longer rely on Eigen's details, see 479. Add Cmake install target. Fix cpp_dec_float construction from string in standalone case for better error handling, see 499. Remove redundent definitions when in C++17 mode, see 530. Fix the error handling in standalone itrunc and ltrunc. Fix potentially uninitialized storage when parsing octal strings. Add arm64 and s390x CI testing. Add some missing expression template unpacking code for powm, see 506. Nowide: Add convert_string overload accepting a (std::)string instance Add quoted to output (quoted UTF-8) paths (std::filesystem or boost::filesystem) to streams PR#170 PFR: Implemented the boost::pfr::is_implicitly_reflectable and the machinery for specializing aggregates as reflectable or not, thanks to Denis Mikhailov for the PR PR#111. Implemented boost::pfr::get by type of an element in the aggregate. Implemented the BOOST_PFR_ENABLED macro to detect library support for reflection, thanks to Denis Mikhailov for the PR PR#86. Fixed missing terminating character, thanks to Denis Mikhailov for the PR PR#114. Fixed the boost/pfr/config.hpp compilation on older compilers, thanks to Denis Mikhailov for the PR PR#118. Workaround for broken C++17 stuctured binding in old compilers, thanks to Denis Mikhailov for the PR PR#119. Avoid -Wzero-as-null-pointer-constant warnings, thanks to Markus F.X.J. Oberhumer for the PR PR#117. Fixed multiple typos, thanks to Denis Mikhailov for the fixes. Added missing #pragma once, thanks to caozhanhao for the PR PR#121. Multiple fixes and improvements for the docs. Process: Added management for extern processes to V2 (still experimental) Deprecated wait_for & wait_until in V1 - they will be removed in the future! Stacktrace: Fixed typos in docs and comments, thanks to Chocobo1 for the PR PR#132. Fixed multithreading flag detection for backtrace_create_state if BOOST_STACKTRACE_BACKTRACE_FORCE_STATIC is defined. StaticString: Boost.Core string_view and std::string_view interoperability Test: Fixed several unused variable warnings Fixed sprintf deprecation warnings Fixed undefined behavior in basic_cstring::rfind Added CI through Github Actions Unordered: Major update. Added node-based, open-addressing containers boost::unordered_node_map and boost::unordered_node_set. Extended heterogeneous lookup to more member functions as specified in P2363. Replaced the previous post-mixing process for open-addressing containers with a new algorithm based on extended multiplication by a constant. Fixed bug in internal emplace impl where stack-local types were not properly constructed using the allocator of the container which breaks uses-allocator construction. URL: Add url::format with automatic percent-encoding URL router example set_params convenience function Support implicit conversions to string_view Parsing constructors are implicit string_token::arg has virtual destructor and slice protection Support BOOST_URL_DISABLE_THREADS Improvements and Bug fixes: WIN32_LEAN_AND_MEAN macro redefinition warning Comparison differentiates absent and empty components Detect hier_part_rule with empty-port-like segments Segments comparison as if normalized works above root hier-part path-rootless considers invalid segments port as number is set to 0 when it overflows ipv4 to string overflow detection algorithm Variant: Now uses core/addressof instead of the deprecated utility/addressof. Thanks to Michael Ford for the PR PR#105. Updated Tools Build: Includes release of B2 version 4.9.4. Compilers Tested Boost's primary test compilers are: Linux: Clang, C++03: 3.4, 3.5, 3.6, 3.7, 3.8, 3.9, 12.0.0, 13.0.0, 14.0.0, 15.0.0 Clang, C++11: 3.4, 11.0.0, 13.0.0, 14.0.0, 15.0.0 Clang, C++14: 3.5, 3.6, 3.7, 3.8, 3.9, 4.0, 5.0, 12.0.0, 13.0.0, 14.0.0, 15.0.0 Clang, C++17: 6.0.1, 7.0.0, 8.0.0, 9.0.0, 10.0.0, 11.0.0, 12.0.0, 13.0.0, 14.0.0, 15.0.0 Clang, C++20: 11.0.0, 12.0.0, 13.0.0, 14.0.0, 15.0.0 GCC, C++03: 4.6.3, 11, 12 GCC, C++11: 4.7.3, 4.8.5, 11, 12 GCC, C++14: 5.4.0, 6.4.0, 7.3.0, 8.0.1, 9.1.0, 11, 12 GCC, C++17: 7.3.0, 8.0.1, 9.1.0, 11, 12 GCC, C++20: 8.0.1, 9.1.0, 10, 11, 12 OS X: Apple Clang, C++03: 11.0.3 Apple Clang, C++11: 11.0.3 Apple Clang, C++14: 11.0.3 Apple Clang, C++17: 11.0.3 Apple Clang, C++20: 11.0.3 Windows: Visual C++: 10.0, 11.0, 12.0, 14.0, 14.1, 14.2, 14.3 Acknowledgements Marshall Clow and Glen Fernandes managed this release.",
        "crawl_status": "success"
      }
    ],
    "expected_years": [
      2024,
      2025,
      2023
    ],
    "actual_years": [],
    "years_extracted": [
      null,
      null,
      null
    ],
    "reason": "年份分布不符合要求（2023、2024、2025各一个）"
  },
  {
    "library": "Qt",
    "entries": [
      {
        "library_name": "Qt",
        "url": "https://www.qt.io/blog/qt-6.6-released",
        "version": "Unknown version",
        "title": "Qt 6.6 Released!",
        "release_date": "Unknown release date",
        "content": "Today marks the 6th time we are releasing new functionality in the Qt 6 series, with small and large additions that make both UI and backend development more productive and fun. Several of the new features come as technology previews, and we are looking forward to your feedback so that we can get everything in tip-top shape for the next LTS release! Let's start with some highlights for user interface developers. Technology Preview: Responsive Layouts with Qt Quick User Interfaces written with Qt have always benefitted from the layout system taking care of positioning and sizing the various elements. This results in resizable UIs that look good in all environments. However, until now it took a bit of manual effort to make user interfaces that adapt the layout itself dynamically, e.g. based on to the available screen space or orientation. This might involve hiding some elements and showing others, replacing parts of the layouts, or even completely re-building the layout structure. With Qt 6.6, we are introducing a new layout element to Qt Quick, the LayoutItemProxy. With this proxy, user interface designers can create and switch between different layouts, typically by binding to geometry properties of the window, and the proxy takes care of automatically placing the user interface elements in the currently active layout structure. Read more about our solution, how it compares to other UI technologies, and how we designed our system, in the blog post about responsive layouts. To give more control over how layouts distribute their content, Qt Quick Layouts learned about uniform cell sizes for row, column, and grid layouts. Additional new features in the Qt Quick module include support for selection modes in TableView, changing the rootIndex in a TreeView, more control over scroll-deceleration in a flickable, and automatic path simplification. Technology Preview: Qt Graphs The Qt Graphs module will combine the functionality of the old OpenGL-based Qt DataVisualization and Qt Charts modules into a single, modern Qt 6 framework. With this first technology preview release of Qt Graphs we are taking the initial step into that direction, focusing on the functionality currently provided by Qt DataVisualization. With Qt Graphs, applications can visualize large quantities of rapidly changing data, using a variety of visualization techniques such as bar, scatter, and surface graphs. The implementation uses Qt 6's rendering hardware interface, and sits on top of Qt Quick 3D. This way, all rendering is hardware accelerated using the native graphics system, and the 3D visualization integrates seamlessly into the scene management and interaction functionality provided by Qt Quick 3D. The module is under active development, with research focusing on an architecture for effective and consistent data management across all use cases, and a high-performant rendering architecture for charts. Have a look at this prototype from earlier this year to get an idea about what we would like to enable with Qt Graphs: Window Capturing in Qt Multimedia With Qt 6.5, we introduced support for screen capturing in Qt Multimedia. With Qt 6.6 we are expanding this feature to allow applications to capture individual windows. The QWindowCapture API and it's QML counterpart provides access to the list of capturable window, so applications that want to implement screen or window sharing can easily provide end-users with a choice of windows. Window capturing support is available with the FFmpeg backend on all desktop platforms, except Wayland-based systems. QMediaRecorder has in addition been extended with new properties for control over video quality, resolution, and bit rates. Qt GRPC and Qt Protobuf improvements Following the introduction of Qt GRPC and Qt Protobuf in Qt 6.5 as technology previews, Qt 6.6 brings significant enhancements to QtGRPC and QtProtobuf. New options like QGrpcChannelOptions and QGrpcCallOptions make channel and call configuration much easier. These options now support a deadline mechanism, limiting the maximum execution time of the call or stream. The new QGrpcMetadata allows users to set client metadata and read metadata returned from the server. In the new release, QtGRPC has integrated QML-type support for the auto-generated QtGRPC client classes. In QtProtobuf, certain Qt Core and Qt GUI types can now be part of the *.proto schema. Implicitly shared data for QProtobufMessage classes allows efficient access in QML contexts. Support for google.protobuf.Any type has been added. Additionally, the oneof type, similar to a union in protobuf, enhances data modelling flexibility. Qt WebEngine adding APIs to Access privacy and security settings Applications that use Qt WebEngine to render web content can now use APIs to access the privacy and security settings. This gives more control about how the Chromium runtime behaves, and allows disabling unwanted capabilities. For example, the QWebEngineUrlScheme::FetchApiAllowed flag can be used to disable or enable the HTML5 Fetch API for custom URL schemes, and the QWebEngineSettings::DisableReadingFromCanvas attribute allows an application to disable reading from the canvas as a protection against finger-printing. Another useful feature added to Qt WebEngine is support for a new chrome://qt URL, which shows a page with information about the Chromium version used. Fine-grained rendering control for application developers A new API in the Font type of Qt Quick allows UI builders to configure specific OpenType font shaping features, and the Qt Quick Shapes module can now use an experimental curve renderer that produces higher quality anti-aliased rendering of curves using a specialized fragment shader. The Ghostscript tiger's tooth rendered at approximately 20x scale. Left to right: curve renderer, geometry renderer and geometry renderer with multi-sampling. Qt's Rendering Hardware Interface abstraction provides a common, low-level API for developing code against the platform-native rendering sub-systems, such as OpenGL, Vulkan, Metal, and Direct3D, which now can also use D3D12. For Qt 6.6 we have started to open up and document the RHI APIs, with the same level of compatibility commitment as we have for our QPA APIs: source and binary incompatible changes might happen between minor releases of Qt, but not within a patch release cycle. This makes it possible for application developers to write low-level, cross-platform code that works on all relevant graphics stacks. Similar work is currently in progress for Qt Quick 3D, where future Qt releases will give application developers fine-grained control over the render pipeline. In Qt 6.6, Qt Quick 3D already learned how to create texture data and mesh geometries procedurally from QML. Qt TextToSpeech: Generate PCM data and easier text and voice management Following the initial Qt 6 release of Qt TextToSpeech in Qt 6.4, one of the most frequent request we got was that the framework would be significantly more useful if it could generate PCM data with the generated speech, in addition to playing the speech on the audio device. With Qt 6.6, we have added that functionality to the QTextToSpeech::synthesize C++ API. Call that function with a lambda to receive the PCM data for further processing. Other improvements include better control over the queueing of text segments, query-APIs to find matching voices, and an API to check which capabilities the current engine supports. For more details, see the blog post. Qt for Python: Support for asyncio and better tooling (A follow up post will highlight more details on the Qt for Python release) Python supports asynchronous operations through coroutines, and asyncio is the best-known package for implementing support for the respective keywords and event-loop integrations. Qt 6.6 adds support for asyncio as technology preview, making sure that Qt's processing of events does not collide with the task processing in asyncio. Qt Creator now finds, adds, and updates existing virtual environments, installs wheels, and allows a new virtual environment for each new Python project. Users of the Qt Installer will be able to install Qt for Python wheels as part of the regular Qt installation. In addition, commercial Qt for Python wheels will be installable easily with the new qtpip tool. Users that need to install Qt for Python wheels will be able to use qtpip as easily as regular pip to do so. And last but not least, Qt for Python is now compatible with AArch64, which makes Qt for Python available on 64bit embedded systems. Updated Platform support Qt for Android now supports Android 13 and uses AndroidX by default. The Supported SDK level is now at 33, matching the Play Store requirement. On the desktop, we have been working on Windows and Linux support for ARM architecture. The Qt 6.6 distribution does not include binary packages for those platforms, but you can make your own build of Qt 6.6 for those platforms using the same process as for x86 architecture. With Qt 6.7 we plan to make official ARM packages available for all desktop operating systems. For Embedded systems, we have upgraded the Yocto support to the latest \"Mickledore\" release, and we have been working with a range of hardware vendors to provide pre-built Boot2Qt packages for NXP boards, the Renesas R-Car device, and various other platforms. Device creators that maintain their own Qt Board Support Package will benefit from enhancements in the QBSP Test Bench when making sure that Qt tests are all green. We have continued our work with the Debian project, and established a new Qt 6 maintainer group. Thanks to this collaboration we now have Qt 6 packages available for Debian 11 and Debian 12 from the regular distribution repositories. Commercial Qt 6.6 packages are available from a Debian repository hosted by The Qt Company. Thanks to this work, both Commercial and Open Source users on Debian-based Linux systems can maintain their Qt installation using regular apt-get workflows. This includes embedded boards that are natively using Debian or Ubuntu distributions, such as the Raspberry Pi 4. The many small things that make a big difference The above is a list of the larger new features, and like every minor release, Qt 6.6 brings many small improvements to existing classes and tools. Permission APIs are now available from QML, QWidget got a convenient overload to set the entire focus chain at once, and the Qt containers got assign() overloads to replace the existing payload without any memory allocations. Many Qt APIs that operate on durations now have overloads for std::chrono, so a timer can be started with a 10s literal value. Similarly, many APIs that work with time stamps now have overloads taking a QTimeZone, which can help reduce the amount of costly conversions between UTC and local time, for example when working with file dates. In the Qt Sql module, the folks from Mimer SQL contributed a plugin for their database backend, and the MySQL/MariaDB driver learned about new connect options. Custom or platform specific clipboard formats can be implemented again, using the new converter classes for macOS and Windows, and the Qt PDF module provides convenient classes for accessing links, get thumbnails of pages, and select pages. Developers targeting the WebAssembly platform can enjoy faster development cycles, easier debugging, and better maintenance thanks to the support for dynamic linking and improvements to the QtLoader. We continue to work on hardening the support for dynamic linking so that applications can be deployed into production with shared Qt libraries and plugins as well. QML source code that has been compiled no longer has to be included with the application binary, and the QML linter supports extensions for custom rules. Work on the QML language server is continuing, and will be a big step to improving the experience for QML developer in Qt Creator, or any other IDE that supports the language server protocol, such as Visual Studio Code. Thanks I’d like to thank all the contributors who have helped with making Qt 6.6 a reality. You can find a full list of all community members that landed a patch to the Qt source code at the end of the release notes. And a special Thanks goes to all of you who have helped making Qt better by reporting bugs, sending us your feedback, or by telling us about your use cases. And last but not least, I'd like to thank everyone involved in getting the release out of the door! As always, the new release will be available in the Qt installer. You can also get the release from our download page or your Qt Account page, and - as mentioned above - through Debian repositories.",
        "crawl_status": "success"
      },
      {
        "library_name": "Qt",
        "url": "https://www.qt.io/blog/qt-6.9-released",
        "version": "Unknown version",
        "title": "Qt 6.9 Released",
        "release_date": "Unknown release date",
        "content": "Qt 6.9 is now available, with new features and improvements for application developers and device creators! As some of the highlights, upgrading to Qt 6.9 brings emoji rendering in existing applications up to the latest standards, order independent transparency for Qt Quick 3D, significant enhancements to address modern OAuth2 requirements, and multiple new performance features across all platforms and devices. On-Demand Webinar Recording: Qt 6.9 Major Feature Updates Otherwise, API additions and new features across the board bring increased flexibility and productivity. Check out the highlights here: More Visualizations with Qt Graphs Rendering of 3D graphs has become more powerful, with support for transparency in Surface3D, a QSpline3DSeries to render data in 3D splines, and more customization options for charts, axis, and labels. Injecting a graph into a View3D from Qt Quick 3D is now easy and allows for very expressive visualization of data in a 3D context. Input handling in 2D charts can now be easily customized, and QGraphsView can be configured with a plotArea for granular positioning of the rectangle the graph will be rendered into. Read more about the improvements in Qt Graphs in Owais' blog post about What's New in Qt Graphs 6.9 . Improved Emoji-Handling Emoji is one of the world's most popular writing systems, and it's also an evolving domain. A few things have happened since we added support for color fonts in Qt 5.2, and with Qt 6.9 we are catching up. Qt now detects emoji sequences in text, and uses the correct color font as needed, according to the Unicode specification. Application developers have control over this process: the parsing can be disabled, the emoji segmenter can be completely left out when building Qt from source, and QFontDatabase has new API to select a specific font family for emoji. The font formats supported for emoji now include CBDT and COLRv1, which provide scalable rendering at high quality across platforms. Read Eskil's blog post for a detailed tour through the history of emoji and support in Qt 6.9. Expanded Client Areas and Safe Areas A staple of modern application design on desktop and mobile is that the content is front and center — with application and system UI elements seamlessly blending into the content in non-intrusive ways. In Qt 6.9 we've introduced new APIs to support this use-case, via the Qt.ExpandedClientAreaHint window flag, and the SafeArea attached property in Qt Quick. In conjunction, these APIs enable the application content to occupy the entire window or screen edge-to-edge, while simultaneously being mindful of crucial system UI elements. Read Tor Arne's blog post for additional details about this new feature. SVG CSS animations Qt's SVG support now includes a first implementation of CSS animations for color, fill, stroke, and transform properties. This is supported in the Qt SVG module when rasterizing an SVG into a sequence of pixmaps, and in the VectorImage element that was introduced in Qt 6.8. With VectorImage, animated SVGs can now be rendered directly into the Qt Quick scene graph. Performance features With each Qt release we focus on making it easier to build performant applications across all platforms and devices. This includes making improvements to our code, but also adding support for new features that have become available from the platforms or graphics subsystems. Many modern CPU architectures include both performance and efficiency cores, and QThread can now set a preference for the kind of CPU core the work should be executed on. Users of QQuickPaintedItem on OpenGL platforms can use FramebufferObject as a rendering mode again, benefiting from hardware accelerated, imperative painting. The OpenGL ES RHI backend now utilizes extensions for multisampled rendering when available, boosting the rendering performance for Qt Quick and Qt Quick 3D HMIs on modern GPU architectures. On Windows, the Direct 3D RHI backend drives updates through a dedicated vblank watcher thread, which reduces CPU load and latency. This gives interactive UIs a much better response, for example when dragging items by mouse or touch. On RHI backends except OpenGL, our RHI abstraction now supports variable rate shading, which enables dynamic foveation support with Qt Quick 3D XR on visionOS. The new RectangularShadow element for Qt Quick, and improved control over shadow map bounds in Qt Quick 3D, allow UI developers to optimise the use of shadow and glow effects and to avoid expensive calculations. Widget applications using Qt's item views can tune the performance when using models where a lot of data changes at once, and the memory usage of QHeaderView has been optimised dramatically as long as resizing and reordering of sections is disabled. Order Independent Transparency Qt Quick 3D now supports Order Independent Transparency, which allows rendering of transparent objects without needing to manually sort the geometry by depth before rendering them. While it comes with some computational and RAM cost, it removes visual errors caused by improper sorting, especially when objects overlap each other. We are already using this technique in Qt Graphs for rendering semi-transparent surface graphs, but it can be used with any model, including instancing. In Qt 6.9, we support the Weighted Blended technique, which provides a good tradeoff between cost, performance, and accuracy. Revitalized Connectivity In Qt 6.8, and now in Qt 6.9, the Qt Network Authorization module introduces significant enhancements to address modern OAuth2 requirements. Notably, it adds support for the Device Authorization Grant, facilitating user authentication on devices with limited input capabilities such as TVs and IoT devices. Additionally, it introduces basic functionality for retrieving ID tokens in OpenID Connect, enabling applications to access user identity information. The module now allows a use alternative browser user-agents, incl. the use of Qt WebEngine, for authentication, and so providing greater flexibility. To improve token management, a new signal alerts when an access token is nearing expiration, and automatic token refreshing can be enabled. Furthermore, the module distinguishes between requested and granted scopes, ensuring applications can accurately adjust their behavior based on the permissions granted by the user. Read Juha's blog post for all the details about what's new in Qt Network Authorization. Even though the Qt HTTP Server is provided to run in a trusted environment, we still spent some extra effort to harden it. The maximum number of incoming requests can now be configured through the QHttpServerConfiguration type, allowing protection against Denial-of-Service attacks, brute-force hacking, or scraping. HTTP/2 clients can control the maximum number of concurrent streams in the QHttp2Configuration. Qt Quick Developer Experience Developer using Qt Quick will benefit from better tooling and new features. The QML Language Server now offers an outline view, enabling IDEs and editors to display a hierarchical representation of a QML document’s structure. This includes objects, properties, and methods. A new ContextMenu component allows developers to easily attach context menus to items, which open on platform-specific events like right-clicks. Additionally, TextField and TextArea now provide a default context menu unless a custom one is specified. Finally, a Metal backend has been added for OpenXR, allowing applications to run in the Meta XR Simulator on macOS. Upgrade to Qt 6.9 Qt 6.9 adds many improvements and new features on top of the current Qt 6.8 LTS release. Qt 6.9 provides binary and source compatibility with all previous Qt 6 releases. With the extensive testing of our beta packages and the feedback provided by many of you, we are confident that upgrading to Qt 6.9 to take advantage of these improvements will be seamless. For a complete list of new APIs, see our documentation. A big thank you goes out to all contributors! You can find a full list of all community members that landed a patch to the Qt source code at the end of the release notes. Still on Qt 5? Standard commercial support for Qt 5.15 will end after the 26th of May 2025. After the support period, the release will be in EoS (End of Support) state and will only be supported through additional services, including the Extended Security Maintenance for Qt 5.15 (ESM). Read more about Qt 5.15 End of Standard Support and ESM. Try Qt 6 online You can now try Qt 6 on your browser - no installation needed. Simply browse to try.qt.io and start exploring!",
        "crawl_status": "success"
      },
      {
        "library_name": "Qt",
        "url": "https://www.qt.io/blog/qt-6.7-released",
        "version": "Unknown version",
        "title": "Qt 6.7 Released!",
        "release_date": "Unknown release date",
        "content": "Qt 6.7 is out with lots of large and small improvements for all of us who like to have fun when building modern applications and user experiences. Several additions are released as technology previews, and we are looking forward to your feedback so that we can get everything ready for the next LTS release! Check out the highlights here: Use C++20 with Qt C++20 is still opt-in and experimental for many compiler toolchains, and for the time being we don't see any reason to require C++20 to build or use Qt. However, we want our users to be able to use the new standard as much as they like in their own code. Some of the changes made between C++17 and C++20 might require adjustments to existing code, and they required adjustments in Qt. For Qt 6.7 we have continued to make adaptations that make Qt feel like a natural part of a modern C++ stack. One helpful addition to the C++20 language is the three-way comparison operator<=>(), also known as the \"spaceship\" operator. When implementing this operator, types are required to specify their ordering category. In Qt 6.7, we have added Qt::{strong,weak,partial}_ordering classes as C++17-compatible implementations of the respective std::*_ordering types. For type authors, Qt 6.7 provides helper macros that can be used to implement relational operators. These macros will expand to operator<=>() in C++20 builds, and fall back to all six operators in C++17 builds. A useful addition to the standard library in C++20 that we wanted to use ourselves, and also make available to Qt users, is std::span. As a non-owning representation of a contiguous sequence of objects, a span is cheap to construct and pass through function calls, and with QSpan we now have a C++17 implementation of that type. We also continued to add std::chrono support to relevant Qt APIs. Transfer timeouts in Qt Network APIs can now be specified as std::chrono types and literals, such as 5s for 5 seconds. Qt Graphs with support for 2D and 3D visualizations In Qt 6.6 we introduced a first technology preview of Qt Graphs as a modern Qt 6 framework for visualizing data on top of a hardware accelerated rendering architecture. With Qt 6.7, we are adding support for 2D bar, line, and scatter graphs, in addition to the 3D visualizations that have already been available since Qt 6.6. The module integrates with Qt Quick animations and effects, and provides theming, and handler-based interaction APIs. Qt Graphs is still under active development, and continues to be a technology preview for this release. We have made some substantial improvements to the data API and architecture to reduce the amount of memory allocations, and to integrate consistently with Qt's abstract item model. We expect additional architectural and API improvements before we take it out of technology preview for Qt 6.8 LTS, and are looking forward to hearing about your use cases and wishes so that we can make sure that we can accommodate them in the best possible way. Connectivity, protocols, and distributed architectures Developers of distributed systems can now work more efficiently with HTTP and REST APIs with the introduction of QHttpHeaders, QRestAccessManager, and QRestReply as new classes for REST-specific use cases. Qt gRPC has introduced new classes for client, server, or bi-directional streaming calls, allowing for seamless messaging that get triggered automatically on value changes. The new Interceptor API makes it possible to add callback functions for selected gRPC messages, for instance to implement caching or logging. With Qt Protobuf in Qt 6.7, developers can now serialize Protobuf-messages to and from JSON, and benefit from generator improvements that support optional fields, and preserve the casing of enum values. These new features make it easier for developers to build robust and scalable applications with Qt. Qt gRPC and Qt Protobuf will graduate from technology preview in the Qt 6.8 release, when the work to complete support for HTTP/2 has been completed. Vector Graphics Since its introduction, Qt SVG has supported the static features of the SVG 1.2 Tiny profile. That particular profile has over the last years become less and less relevant, and authoring tools have for a long time not followed any specific profile. For Qt 6.7, we analyzed which static elements from SVG 1.1 and 2.0 are commonly used in SVG assets, and added support for those features that we encountered most frequently: <symbol>, <marker>, <pattern>, <mask>, and the various <filter> elements. With Qt SVG in 6.7, applications can render the majority of SVG files relevant for UI builders. If full support for SVG 2.0 is required, then the Qt WebEngine module continues to be the right choice. In addition to importing SVGs as pre-rendered pixmaps into Qt UIs, we are also working on importing vector graphics assets directly into the Qt Quick scene graph. The new (and experimental) svgtoqml tool converts SVG to QML, and we have made improvements in the Qt Quick Shapes module to render in higher quality. The curve renderer introduced as technology preview in Qt 6.6 is now fully supported, and can be enabled using the preferredRendererType property. Improvements to Fonts and Icons After introducing support for typographic font features in Qt 6.6, we have followed up with support for variable fonts in Qt 6.7. Variable fonts combine variations of a single type face into a single font file, allowing applications to select any value of \"weight\" or \"cursiveness.\" Depending on what variable axes the font designer creates, a glyph might be animated or show different layers. Read more about the variable font support and other text improvements in Eskil's blog post. The API is now stable and consistently uses the new QFont::Tag class for specifying font features and axis names in a type-safe fashion. The improved support for modern fonts has enabled us to add support for native icon libraries, which are often provided through fonts. The QIcon::fromTheme implementation now maps the XDG icon name to the corresponding symbol in the native icon libraries on Apple, Windows, and Android platforms. For the future we plan to use the new capabilities of our font API to add support for more icon features, such as outlined or filled versions of an icon. Hybrid applications with native UI elements and rendering On both desktop and mobile platforms, applications often need to combine UI elements from different technologies and frameworks. Qt uses and integrates tightly with the native technologies on each platform to create basic UI elements such as windows, and it has for a long time been possible to use UI elements from other frameworks within a Qt Widgets application. With Qt 6.7, we are now adding support for embedding native windows into a Qt Quick scene as well. This allows use of native controls such as AppKit's MapView or a Windows media player inside a Qt Quick UI, with correct positioning and stacking. By layering windows, Qt Quick UI elements can be overlaid on top of the native components as well. In addition, applications can now add rendering code, using any of the graphics APIs supported by Qt, to a Qt Quick or Qt Widgets application, by using the QRhiQuickItem and QRhiWidget classes, respectively. While such code might often not be fully cross-platform (as Vulkan, OpenGL, Direct3D, or Metal are not equally well supported on all possible target platforms), it makes it possible to integrate 3rd party frameworks that use those technologies, or to write highly optimized rendering code for any specific platform. Updated Platform support As with every minor release we have updated the list of supported platforms to include the latest stable versions of relevant operating systems. On desktop and mobile, Qt 6.7 fully supports macOS 14 and iOS 17, Windows 11 23H2, and Android 14. RedHat 9.2, Open Suse 5.15, SUSE Linux Enterprise Server 15 are the latest supported Linux distributions (Ubuntu remains on 22.04). Prebuilt binaries for Windows using the LLVM-based MinGW toolchain are available from the installer, and Windows and Linux on ARM are both available as technology preview. On embedded, the Boot2Qt reference images support Yocto 4.3 Nanbield. As real-time operating systems, Qt 6.7 now includes a source-only technology preview for VxWorks 7 using SR 24.03 on iMX6 hardware, and pre-built binaries for QNX 7.1 are available from the online installer. New and improved examples and demos In addition to improvements in the framework, we have curated the examples and demo applications that ship with Qt, and refreshed the UI and coding style. We also created a few new applications that showcase what is possible when designers and developers work together to combine the UI, visualization, and backend capabilities of Qt. The Lightning Viewer example uses Qt Location and Qt Quick Controls to visualize simulated lightning data, received via Qt WebSocket. The style for the controls was entirely created in Figma. The completely recreated StocQt example uses Qt Graphs to visualize stock data based on the NASDAQ-100. The example's UI was created using Qt Design Studio, and if an API key is provided through the settings dialog, then the data is real-time information as received from the Financial Modeling Prep service. The new OSM Buildings example combines Qt Quick 3D with Qt Positioning and Qt Network to implement a 3D viewer of buildings map data as received from the OpenStreetMap service. Virtual assistants are becoming increasingly popular in user interfaces, and the new Virtual Assistant example shows how easy it is to bring a 3D model to life through timeline animations. And last but not least, the new Volumetric rendering example uses the new support for 3D textures in Qt Quick 3D to implement volume ray casting. Qt for Python Once new functionality is added to Qt, our Python offering needs to adapt those in order to enable them for our Python users. Besides what's described here, many other changes were made to PySide and Shiboken that will be described in a follow-up post. Stay tuned! The many small things that make a big difference The above is a list of the larger new features, and like every minor release, Qt 6.7 brings many small improvements to existing classes and tools. Those additions are too numerous for this post, but you can find a comprehensive list of all additions in the documentation of What's New in Qt 6.7. Thanks I’d like to thank all the contributors who have helped with making Qt 6.7 a reality. You can find a full list of all community members that landed a patch to the Qt source code at the end of the release notes. And a special Thanks goes to all of you who have helped making Qt better by reporting bugs, sending us your feedback, or by telling us about your use cases. And last but not least, I'd like to thank everyone involved in getting the release out of the door! As always, the new release will be available in the Qt installer. You can also get the release from our download page or your Qt Account page, and - as mentioned above - through Debian repositories.",
        "crawl_status": "success"
      }
    ],
    "expected_years": [
      2024,
      2025,
      2023
    ],
    "actual_years": [],
    "years_extracted": [
      null,
      null,
      null
    ],
    "reason": "年份分布不符合要求（2023、2024、2025各一个）"
  },
  {
    "library": "LLVM",
    "entries": [
      {
        "library_name": "LLVM",
        "url": "https://releases.llvm.org/20.1.0/docs/ReleaseNotes.html",
        "version": "Unknown version",
        "title": "LLVM 20.1.0 Release Notes — LLVM 20.1.0 documentation",
        "release_date": "Unknown release date",
        "content": "Introduction This document contains the release notes for the LLVM Compiler Infrastructure, release 20.1.0. Here we describe the status of LLVM, including major improvements from the previous release, improvements in various subprojects of LLVM, and some of the current users of the code. All LLVM releases may be downloaded from the LLVM releases web site. For more information about LLVM, including information about the latest release, please check out the main LLVM web site. If you have questions or comments, the Discourse forums is a good place to ask them. Note that if you are reading this file from a Git checkout or the main LLVM web page, this document applies to the next release, not the current one. To see the release notes for a specific release, please see the releases page. Non-comprehensive list of changes in this release Added a new IRNormalizer pass which aims to transform LLVM modules into a normal form by reordering and renaming instructions while preserving the same semantics. The normalizer makes it easier to spot semantic differences when diffing two modules which have undergone different passes. The SPIR-V backend is now an official LLVM target, providing OpenCL and SYCL conformance and establishing a foundation for broader applicability to other APIs, including Vulkan, GLSL, and HLSL. This backend aims to offer a unified approach for diverse compute and graphics workloads, providing a robust alternative to the Khronos SPIR-V LLVM Translator. … Changes to the LLVM IR Types are no longer allowed to be recursive. The x86_mmx IR type has been removed. It will be translated to the standard vector type <1 x i64> in bitcode upgrade. Renamed llvm.experimental.stepvector intrinsic to llvm.stepvector. Added usub_cond and usub_sat operations to atomicrmw. Introduced noalias.addrspace metadata. Remove the following intrinsics which can be replaced with a bitcast: llvm.nvvm.bitcast.f2i llvm.nvvm.bitcast.i2f llvm.nvvm.bitcast.d2ll llvm.nvvm.bitcast.ll2d Remove the following intrinsics which can be replaced with a funnel-shift: llvm.nvvm.rotate.b32 llvm.nvvm.rotate.right.b64 llvm.nvvm.rotate.b64 Remove the following intrinsics which can be replaced with an addrspacecast: llvm.nvvm.ptr.gen.to.global llvm.nvvm.ptr.gen.to.shared llvm.nvvm.ptr.gen.to.constant llvm.nvvm.ptr.gen.to.local llvm.nvvm.ptr.global.to.gen llvm.nvvm.ptr.shared.to.gen llvm.nvvm.ptr.constant.to.gen llvm.nvvm.ptr.local.to.gen Remove the following intrinsics which can be relaced with a load from addrspace(1) with an !invariant.load metadata llvm.nvvm.ldg.global.i llvm.nvvm.ldg.global.f llvm.nvvm.ldg.global.p Operand bundle values can now be metadata strings. Fast math flags are now permitted on fptrunc and fpext. Changes to LLVM infrastructure Two methods that use Instruction pointers as code positions (moveBefore, getFirstNonPHI) have been deprecated in favour of overloads and variants that use BasicBlock::iterators instead. The pointer-flavoured methods will be removed in a future release. This work is part of the RemoveDIs project, the documentation for which contains instructions for updating call-sites using the deprecated methods. Changes to building LLVM Raised the minimum MSVC version to Visual Studio 2019 16.8. Deprecated support for building compiler-rt with LLVM_ENABLE_PROJECTS. Users should instead use LLVM_ENABLE_RUNTIMES, either through the runtimes or the bootstrapping build. Deprecated support for building libc with LLVM_ENABLE_PROJECTS. Users should instead use LLVM_ENABLE_RUNTIMES, either through the runtimes or the bootstrapping build. Changes to TableGen The ARMTargetDefEmitter now binds Funtion Multi Versioning features to the corresponding AArch64 Architecture Extensions such that their dependencies can be autogenerated using TableGen. Changes to Interprocedural Optimizations Added RelLookupTableConverterPass to LTO post-link pass pipeline. Changes to the AArch64 Backend .balign N, 0, .p2align N, 0, .align N, 0 in code sections will now fill the required alignment space with a sequence of 0x0 bytes (the requested fill value) rather than NOPs. Assembler/disassembler support has been added for Armv9.6-A (2024) architecture extensions. Added support for the FUJITSU-MONAKA CPU. Updated feature dependency in Armv9.6 for FEAT_FAMINMAX, FEAT_LUT and FEAT_FP8, now they depend only on FEAT_NEON. Changes to the AMDGPU Backend Initial support for gfx950 Improved llvm.memcpy, llvm.memmove and llvm.memset lowering Fixed expansion of 64-bit flat address space atomicrmw and cmpxchg operations which may access private memory. noalias.addrspace metadat may be used to avoid the expansion if the target address is known to not be on the stack. Fix compile failures when emitting unreachable functions. Removed llvm.amdgcn.flat.atomic.fadd and llvm.amdgcn.global.atomic.fadd intrinsics. Users should use the atomicrmw instruction with fadd and addrspace(0) or addrspace(1) instead. Changes to the ARM Backend .balign N, 0, .p2align N, 0, .align N, 0 in code sections will now fill the required alignment space with a sequence of 0x0 bytes (the requested fill value) rather than NOPs. The default behavior for frame pointers in leaf functions has been updated. When the -fno-omit-frame-pointer option is specified, FPKeepKindStr is set to -mframe-pointer=all, meaning the frame pointer (FP) is now retained in leaf functions by default. To eliminate the frame pointer in leaf functions, you must explicitly use the -momit-leaf-frame-pointer option. When using the MOVT or MOVW instructions, the Assembler will now check to ensure that any addend that is used is within a 16-bit signed value range. If the addend falls outside of this range, the LLVM backend will emit an error like so Relocation Not In Range. Changes to the AVR Backend Changes to the DirectX Backend Changes to the Hexagon Backend Changes to the LoongArch Backend Incorrect GOT usage for non-dso_local function calls in large code model is fixed. A gprof support issue is fixed. A SDAG hang issue caused by ISD::CONCAT_VECTORS is fixed. A compiler crash issue when converting half to i32 is fixed. Almost all of la64v1.1 instructions can now be generated. The full list is frecipe.s, frecipe.d, frsqrte.s, frsqrte.d, vfrecipe.s, vfrecipe.d, vfrsqrte.s, vfrsqrte.d, xvfrecipe.s, xvfrecipe.d, xvfrsqrte.s, xvfrsqrte.d, sc.q, amcas.b, amcas.h, amcas.w, amcas.d, amcas_db.b, amcas_db.h, amcas_db.w, amcas_db.d, amswap.b, amswap.h, amswap_db.b, amswap_db.h, amadd.b, amadd.h, amadd_db.b, amadd_db.h. Optionally generate instructions dbar 0x700, div.w, div.wu, mod.w and mod.wu when related target features are enabled. llacq.w, screl.w, llacq.d and screl.d cannot be generated yet. An llc option called -loongarch-annotate-tablejump is added to annotate table jump instruction in the .discard.tablejump_annotate section. A typical user of these annotations is the objtool in Linux kernel. The default cpu in MCSubtargetInfo is changed from la464 to generic-la64. In addition, the lsx feature is added to generic-la64. CFI instructions now allow register names and aliases, previously only numbers were allowed. RuntimeDyld now supports LoongArch, which means that programs relying on MCJIT can now work. .balign N, 0, .p2align N, 0, .align N, 0 in code sections will now fill the required alignment space with a sequence of 0x0 bytes (the requested fill value) rather than NOPs. %ld_pcrel_20, %gd_pcrel_20 and %desc_pcrel_20 operand modifiers are supported by assembler. A machine function pass called LoongArch Merge Base Offset is added to merge the offset of address calculation into the offset field of instructions in a global address lowering sequence. The LoopDataPrefetch pass can now work on LoongArch, but it is disabled by default due to the bad effect on Fortran benchmarks. Enable alias analysis by default. Avoid indirect branch jumps using the $ra register. Other optimizations. Changes to the MIPS Backend Changes to the PowerPC Backend The Linux ppc64 LLC default cpu is updated from ppc to ppc64. Replaced PPCMergeStringPool with GlobalMerge. Disabled vsx and altivec when -msoft-float is used. Added support for -mcpu=pwr11 -mtune=pwr11. Implemented BCD assist builtins. Expanded global named register support. Updated to use tablegen’s MatchRegisterName(). Fixed saving of Link Register when using ROP Protect. Fixed SUBREG_TO_REG handling in the RegisterCoalescer. Fixed data layout alignment of i128 to 16. Fixed codegen for transparent_union function parameters. Added an error for incorrect use of memory operands. Other various bug fixes and codegen improvements. AIX Specific: LLC default cpu is updated from generic to pwr7. Fixed handling in emitGlobalConstantImpl to emit aliases to subobjects at proper offsets. Enabled aggressive merging of constants to reduce TOC entries. Changes to the RISC-V Backend .balign N, 0, .p2align N, 0, .align N, 0 in code sections will now fill the required alignment space with a sequence of 0x0 bytes (the requested fill value) rather than NOPs. Added Syntacore SCR4 and SCR5 CPUs: -mcpu=syntacore-scr4/5-rv32/64 -mcpu=sifive-p470 was added. Added Hazard3 CPU as taped out for RP2350: -mcpu=rp2350-hazard3 (32-bit only). Fixed length vector support using RVV instructions now requires VLEN>=64. This means Zve32x and Zve32f will also require Zvl64b. The prior support was largely untested. The Zvbc32e and Zvkgs extensions are now supported experimentally. Added Smctr, Ssctr and Svvptc extensions. -mcpu=syntacore-scr7 was added. -mcpu=tt-ascalon-d8 was added. -mcpu=mips-p8700 was added. -mcpu=sifive-p550 was added. The Zacas extension is no longer marked as experimental. Added Smdbltrp, Ssdbltrp extensions to -march. The Smmpm, Smnpm, Ssnpm, Supm, and Sspm pointer masking extensions are no longer marked as experimental. The Sha extension is now supported. The RVA23U64, RVA23S64, RVB23U64, and RVB23S64 profiles are no longer marked as experimental. .insn <length>, <raw encoding> can be used to assemble 48- and 64-bit instructions from raw integer values. .insn [<length>,] <raw encoding> now accepts absolute expressions for both expressions, so that they can be computed from constants and absolute symbols. The following new inline assembly constraints and modifiers are accepted: cr constraint meaning an RVC-encoding compatible GPR (x8-x15) cf constraint meaning an RVC-encoding compatible FPR (f8-f15) R constraint meaning an even-odd GPR pair (prints as the even register, but both registers in the pair are considered live). cR constraint meaning an RVC-encoding compatible even-odd GPR Pair (prints as an even register between x8 and x14, but both registers in the pair are considered live). N modifer meaning print the register encoding (0-31) rather than the name. f and cf inline assembly constraints, when using F-/D-/H-in-X extensions, will use the relevant GPR rather than FPR. This makes inline assembly portable between e.g. F and Zfinx code. Adds experimental assembler support for the Qualcomm uC ‘Xqcicsr` (CSR) extension. Adds experimental assembler support for the Qualcomm uC ‘Xqcisls` (Scaled Load Store) extension. Adds experimental assembler support for the Qualcomm uC ‘Xqcia` (Arithmetic) extension. Adds experimental assembler support for the Qualcomm uC ‘Xqciac` (Load-Store Address Calculation) extension. Adds experimental assembler support for the Qualcomm uC ‘Xqcics` (Conditonal Select) extension. Adds experimental assembler support for the Qualcomm uC ‘Xqcilsm` (Load Store Multiple) extension. Adds experimental assembler support for the Qualcomm uC ‘Xqcicli` (Conditional Load Immediate) extension. Adds experimental assembler support for the Qualcomm uC ‘Xqcicm` (Conditonal Move) extension. Adds experimental assembler support for the Qualcomm uC ‘Xqciint` (Interrupts) extension. Adds experimental assembler support for the Qualcomm uC ‘Xqcilo` (Large Offset Load Store) extension. Added Sdext and Sdtrig extensions. Changes to the WebAssembly Backend The default target CPU, “generic”, now enables the -mnontrapping-fptoint and -mbulk-memory flags, which correspond to the Bulk Memory Operations and Non-trapping float-to-int Conversions language features, which are widely implemented in engines. A new Lime1 target CPU is added, -mcpu=lime1. This CPU follows the definition of the Lime1 CPU here, and enables -mmultivalue, -mmutable-globals, -mcall-indirect-overlong, -msign-ext, -mbulk-memory-opt, -mnontrapping-fptoint, and -mextended-const. Support for the new standardized Exception Handling proposal is added. The legacy Exception Handling proposal is still supported, and turned on by the newly added -wasm-use-legacy-eh option. Given that major web browsers still default to the legacy EH proposal, this option is turned on by default for the moment. Changes to the Windows Target Changes to the X86 Backend .balign N, 0x90, .p2align N, 0x90, and .align N, 0x90 in code sections now fill the required alignment space with repeating 0x90 bytes, rather than using optimised NOP filling. Optimised NOP filling fills the space with NOP instructions of various widths, not just those that use the 0x90 byte encoding. To use optimised NOP filling in a code section, leave off the “fillval” argument, i.e. .balign N, .p2align N or .align N respectively. Due to the removal of the x86_mmx IR type, functions with x86_mmx arguments or return values will use a different, incompatible, calling convention ABI. Such functions are not generally seen in the wild (Clang never generates them!), so this is not expected to result in real-world compatibility problems. Support ISA of AVX10.2-256 and AVX10.2-512. Supported instructions of MOVRS AND AVX10.2 Supported ISA of SM4(EVEX). Supported ISA of MSR_IMM. Supported -mcpu=diamondrapids Supported emitting relocation types for x86-64 target: R_X86_64_CODE_4_GOTPCRELX R_X86_64_CODE_4_GOTTPOFF R_X86_64_CODE_4_GOTPC32_TLSDESC R_X86_64_CODE_6_GOTTPOFF Changes to the OCaml bindings Changes to the Python bindings Changes to the C API The following symbols are deleted due to the removal of the x86_mmx IR type: LLVMX86_MMXTypeKind LLVMX86MMXTypeInContext LLVMX86MMXType The following functions are added to further support non-null-terminated strings: LLVMGetNamedFunctionWithLength LLVMGetNamedGlobalWithLength The following functions are added to access the LLVMContextRef associated with LLVMValueRef and LLVMBuilderRef objects: LLVMGetValueContext LLVMGetBuilderContext The new pass manager can now be invoked with a custom alias analysis pipeline, using the LLVMPassBuilderOptionsSetAAPipeline function. It is now also possible to run the new pass manager on a single function, by calling LLVMRunPassesOnFunction instead of LLVMRunPasses. Support for creating instructions with custom synchronization scopes has been added: LLVMGetSyncScopeID to map a synchronization scope name to an ID. LLVMBuildFenceSyncScope, LLVMBuildAtomicRMWSyncScope and LLVMBuildAtomicCmpXchgSyncScope versions of the existing builder functions with an additional synchronization scope ID parameter. LLVMGetAtomicSyncScopeID and LLVMSetAtomicSyncScopeID to get and set the synchronization scope of any atomic instruction. LLVMIsAtomic to check if an instruction is atomic, for use with the above functions. Because of backwards compatibility, LLVMIsAtomicSingleThread and LLVMSetAtomicSingleThread continue to work with any instruction type. The LLVMSetPersonalityFn and LLVMSetInitializer APIs now support clearing the personality function and initializer respectively by passing a null pointer. The following functions are added to allow iterating over debug records attached to instructions: LLVMGetFirstDbgRecord LLVMGetLastDbgRecord LLVMGetNextDbgRecord LLVMGetPreviousDbgRecord Added LLVMAtomicRMWBinOpUSubCond and LLVMAtomicRMWBinOpUSubSat to LLVMAtomicRMWBinOp enum for AtomicRMW instructions. Changes to the CodeGen infrastructure GlobalOpt can now statically resolve calls to multi-versioned functions when targeting AArch64. These calls would otherwise be routed through an IFunc resolver function. This optimization can be applied when the caller is either a multi-versioned function itself, or it is compiled with a sufficiently high set of architecture features (including the target attribute, and command line options). Changes to the Metadata Info Multi-versioned functions targeting AArch64 are annotated with new metadata named fmv-features. The metadata string value consists of a comma-separated list of Function Multi Versioning feature names as defined in the Arm C Language Extensions (ACLE). Changes to the Debug Info Changes to the LLVM tools llvm-objcopy now supports the following options for Mach-O: --globalize-symbol, --globalize-symbols, --keep-global-symbol, --keep-global-symbols, --localize-symbol, --localize-symbols, --skip-symbol, --skip-symbols. llvm-objcopy now prints the correct file path in the error message when the output file specified by --dump-section cannot be opened. llvm-cxxfilt now supports demangling call expressions encoded using cp instead of cl. llvm-objdump now supports printing the file header, load section header and auxiliary header for XCOFF object files under the --private-headers option. Changes to LLDB It is now recommended that LLDB be built with Python >= 3.8, but no changes have been made to the supported Python versions. The next release, LLDB 21, will require Python >= 3.8. LLDB now supports inline diagnostics for the expression evaluator and command line parser. Old: (lldb) p a+b error: <user expression 0>:1:1: use of undeclared identifier 'a' 1 | a+b | ^ error: <user expression 0>:1:3: use of undeclared identifier 'b' 1 | a+b | ^ New: (lldb) p a+b ˄ ˄ │ ╰─ error: use of undeclared identifier 'b' ╰─ error: use of undeclared identifier 'a' Program stdout/stderr redirection will now open the file with O_TRUNC flag, make sure to truncate the file if path already exists. eg. settings set target.output-path/target.error-path <path/to/file> A new setting target.launch-working-dir can be used to set a persistent cwd that is used by default by process launch and run. LLDB now parses shared libraries in parallel, resulting in an average 2x speedup when attaching (only available on Darwin platforms) and launching (available on all platforms). It is now possible to implement lldb commands in Python that use lldb’s native command-line parser. In particular, that allows per-option/argument completion, with all the basic completers automatically supported and auto-generated help. The command template file in lldb/examples/python/cmdtemplate.py has been updated to show how to use this. Breakpoints on “inlined call sites” are now supported. Previous to this fix, breakpoints on source lines that only contained inlined call sites would be moved to the next source line, causing you to miss the inlined executions. On the command line, LLDB now limits tab completions to your terminal width to avoid wrapping. Old: Available completions: _regexp-attach -- Attach to process by ID or name. _regexp-break -- Set a breakpoint using one of several shorthand formats. _regexp-bt -- Show backtrace of the current thread's call sta ck. Any numeric argument displays at most that many frames. The argument 'al l' displays all threads. Use 'settings set frame-format' to customize the pr inting of individual frames and 'settings set thread-format' to customize th e thread header. Frame recognizers may filter thelist. Use 'thread backtrace -u (--unfiltered)' to see them all. _regexp-display -- Evaluate an expression at every stop (see 'help target stop-hook'.) New: Available completions: _regexp-attach -- Attach to process by ID or name. _regexp-break -- Set a breakpoint using one of several shorth... _regexp-bt -- Show backtrace of the current thread's call ... _regexp-display -- Evaluate an expression at every stop (see 'h... DWARF indexing speed (for binaries not using the debug_names index) increased by 30-60%. The frame diagnose now works on ELF-based systems. After a crash, LLDB will try to determine the likely cause of the signal, matching Darwin behavior. This feature requires using a new lldb-server version and (like Darwin) only works on x86 binaries. * thread #1, name = 'a.out', stop reason = signal SIGSEGV: address not mapped to object (fault address=0x4) frame #0: 0x00005555555551aa a.out`GetSum(f=0x0000555555558018) at main.c:21:37 18 } 19 20 int GetSum(struct Foo *f) { -> 21 return SumTwoIntegers(f->a, f->b->d ? 0 : 1); 22 } 23 24 int main() { Likely cause: f->b->d accessed 0x4 Minidumps generated by LLDB now support: 64 bit memory (due to 64b support, Minidumps are now paged to disk while being written). Capturing of TLS variables. Multiple signals or exceptions, including breakpoints. New Core File API. This gives greater control on the data captured into the core file, relative to the existing process save-core styles. When opening ELF core files, LLDB will print additional information about the signal that killed the process and the disassembly view will display actual (relocated) targets of the jump instructions instead of raw offsets encoded in the instruction. This matches existing behavior for live processes. Old: * thread #1: tid = 329384, 0x0000000000401262, name = 'a.out', stop reason = signal SIGSEGV 0x7f1e3193e0a7 <+23>: ja 0xfe100 ; <+112> New: * thread #1: tid = 329384, 0x0000000000401262, name = 'a.out', stop reason = SIGSEGV: address not mapped to object (fault address=0x0) 0x7f1e3193e0a7 <+23>: ja 0x7f1e3193e100 ; <+112> lldb-server now listens to a single port for gdbserver connections and provides that port to the connection handler processes. This means that only 2 ports need to be opened in the firewall (one for the lldb-server platform, one for gdbserver connections). In addition, due to this work, lldb-server now works on Windows in the server mode. LLDB can now read the fpmr register from AArch64 Linux processes and core files. Support was added for debugging AArch64 Linux programs that use the Guarded Control Stack extension (GCS). This includes live processes and core files. LLDB now supports execution of user expressions for non-trivial cases for LoongArch and RISC-V targets, like function calls, when some code needs to be executed on the target. LLDB now supports optionally enabled/disabled register sets (particularly floating point registers) for RISC-V 64. This happens for targets like RV64IMAC or RV64IMACV, that have no floating point registers. The change is applied to native debugging and core-file usage. LLDB now supports core-file for LoongArch. LLDB now supports hardware breakpoint and watchpoint for LoongArch. LLDB now supports vector registers for LoongArch when debugging a live process. Incorrect floating-point register DWARF numbers for LoongArch were fixed. Support was added for handling the GDB Remote Protocol x packet in the format introduced by GDB 16.2. LLDB currently uses a different format for x and LLDB is now able to handle both formats. At some point in the future support for LLDB’s format of x will be removed. Changes to BOLT Changes to Sanitizers Changes to the Profile Runtime On platforms where atexit-registered functions are not called when a DSO is dlclose’d, a mechanism is added that implements this missing functionality for calls to atexit in the profile runtime. This is currently only enabled on AIX. Other Changes External Open Source Projects Using LLVM 20.1.0 A project… Additional Information A wide variety of additional information is available on the LLVM web page, in particular in the documentation section. The web page also contains versions of the API documentation which is up-to-date with the Git version of the source code. You can access versions of these documents specific to this release by going into the llvm/docs/ directory in the LLVM tree. If you have any questions or comments about LLVM, please feel free to contact us via the Discourse forums.",
        "crawl_status": "success"
      },
      {
        "library_name": "LLVM",
        "url": "https://releases.llvm.org/18.1.0/docs/ReleaseNotes.html",
        "version": "18.1.0rc",
        "title": "LLVM 18.1.0rc Release Notes — LLVM 18.1.0rc documentation",
        "release_date": "Unknown release date",
        "content": "Introduction This document contains the release notes for the LLVM Compiler Infrastructure, release 18.1.0rc. Here we describe the status of LLVM, including major improvements from the previous release, improvements in various subprojects of LLVM, and some of the current users of the code. All LLVM releases may be downloaded from the LLVM releases web site. For more information about LLVM, including information about the latest release, please check out the main LLVM web site. If you have questions or comments, the Discourse forums is a good place to ask them. Note that if you are reading this file from a Git checkout or the main LLVM web page, this document applies to the next release, not the current one. To see the release notes for a specific release, please see the releases page. Non-comprehensive list of changes in this release … Update on required toolchains to build LLVM Changes to the LLVM IR The llvm.stacksave and llvm.stackrestore intrinsics now use an overloaded pointer type to support non-0 address spaces. The constant expression variants of the following instructions have been removed: and or lshr ashr zext sext fptrunc fpext fptoui fptosi uitofp sitofp Added llvm.exp10 intrinsic. Added a code_model attribute for the global variable. Changes to LLVM infrastructure Minimum Clang version to build LLVM in C++20 configuration has been updated to clang-17.0.6. Changes to building LLVM Changes to TableGen Added constructs for debugging TableGen files: dump keyword to dump messages to standard error, see https://github.com/llvm/llvm-project/pull/68793. !repr bang operator to inspect the content of values, see https://github.com/llvm/llvm-project/pull/68716. Changes to Interprocedural Optimizations Changes to the AArch64 Backend Added support for Cortex-A520, Cortex-A720 and Cortex-X4 CPUs. Neoverse-N2 was incorrectly marked as an Armv8.5a core. This has been changed to an Armv9.0a core. However, crypto options are not enabled by default for Armv9 cores, so -mcpu=neoverse-n2+crypto is now required to enable crypto for this core. As far as the compiler is concerned, Armv9.0a has the same features enabled as Armv8.5a, with the exception of crypto. Assembler/disassembler support has been added for 2023 architecture extensions. Support has been added for Stack Clash Protection. During function frame creation and dynamic stack allocations, the compiler will issue memory accesses at reguilar intervals so that a guard area at the top of the stack can’t be skipped over. Changes to the AMDGPU Backend llvm.sqrt.f32 is now lowered correctly. Use llvm.amdgcn.sqrt.f32 for raw instruction access. Implemented llvm.stacksave and llvm.stackrestore intrinsics. Implemented llvm.get.rounding The default AMDHSA code object version is now 5. Changes to the ARM Backend Added support for Cortex-M52 CPUs. Added execute-only support for Armv6-M. Changes to the AVR Backend Changes to the DirectX Backend Changes to the Hexagon Backend Changes to the LoongArch Backend Added intrinsics support for all LSX (128-bits SIMD) and LASX (256-bits SIMD) instructions. Added definition and intrinsics support for new instructions that were introduced in LoongArch Reference Manual V1.10. Emitted adjacent pcaddu18i+jirl instrunction sequence with one relocation R_LARCH_CALL36 instead of pcalau12i+jirl with two relocations R_LARCH_PCALA_{HI20,LO12} for function call in medium code model. The code model of global variables can now be overridden by means of the newly added LLVM IR attribute, code_model. Added support for the llvm.is.fpclass intrinsic. mulodi4 and muloti4 libcalls were disabled due to absence in libgcc. Added initial support for auto vectorization. Added initial support for linker relaxation. Assorted codegen improvements. Changes to the MIPS Backend Changes to the PowerPC Backend LLJIT’s JIT linker now defaults to JITLink on 64-bit ELFv2 targets. Initial-exec TLS model is supported on AIX. Implemented new resource based scheduling model of POWER7 and POWER8. frexp libcall now references correct symbol name for fp128. Optimized materialization of 64-bit immediates, code generation of vec_promote and atomics. Global constant strings are pooled in the TOC under one entry to reduce the number of entries in the TOC. Added a number of missing Power10 extended mnemonics. Added the SCV instruction. Fixed register class for the paddi instruction. Optimize VPERM and fix code order for swapping vector operands on LE. Added various bug fixes and code gen improvements. AIX Support/improvements: Support for a non-TOC-based access sequence for the local-exec TLS model (called small local-exec). XCOFF toc-data peephole optimization and bug fixes. Move less often used __ehinfo TOC entries to the end of the TOC section. Fixed problems when the AIX libunwind unwinds starting from a signal handler and the function that raised the signal happens to be a leaf function that shares the stack frame with its caller or a leaf function that does not store the stack frame backchain. Changes to the RISC-V Backend The Zfa extension version was upgraded to 1.0 and is no longer experimental. Zihintntl extension version was upgraded to 1.0 and is no longer experimental. Intrinsics were added for Zk*, Zbb, and Zbc. See https://github.com/riscv-non-isa/riscv-c-api-doc/blob/master/riscv-c-api.md#scalar-bit-manipulation-extension-intrinsics Default ABI with F but without D was changed to ilp32f for RV32 and to lp64f for RV64. The Zvbb, Zvbc, Zvkb, Zvkg, Zvkn, Zvknc, Zvkned, Zvkng, Zvknha, Zvknhb, Zvks, Zvksc, Zvksed, Zvksg, Zvksh, and Zvkt extension version was upgraded to 1.0 and is no longer experimental. However, the C intrinsics for these extensions are still experimental. To use the C intrinsics for these extensions, -menable-experimental-extensions needs to be passed to Clang. XSfcie extension and SiFive CSRs and instructions that were associated with it have been removed. None of these CSRs and instructions were part of “SiFive Custom Instruction Extension” as SiFive defines it. The LLVM project needs to work with SiFive to define and document real extension names for individual CSRs and instructions. -mcpu=sifive-p450 was added. CodeGen of RV32E/RV64E was supported experimentally. CodeGen of ilp32e/lp64e was supported experimentally. Support was added for the Ziccif, Ziccrse, Ziccamoa, Zicclsm, Za64rs, Za128rs and Zic64b extensions which were introduced as a part of the RISC-V Profiles specification. The Smepmp 1.0 extension is now supported. -mcpu=sifive-p670 was added. Support for the Zicond extension is no longer experimental. Changes to the WebAssembly Backend Changes to the Windows Target The LLVM filesystem class UniqueID and function equivalent() no longer determine that distinct different path names for the same hard linked file actually are equal. This is an intentional tradeoff in a bug fix, where the bug used to cause distinct files to be considered equivalent on some file systems. This change fixed the issues https://github.com/llvm/llvm-project/issues/61401 and https://github.com/llvm/llvm-project/issues/22079. Changes to the X86 Backend The i128 type now matches GCC and clang’s __int128 type. This mainly benefits external projects such as Rust which aim to be binary compatible with C, but also fixes code generation where LLVM already assumed that the type matched and called into libgcc helper functions. Support ISA of USER_MSR. Support ISA of AVX10.1-256 and AVX10.1-512. -mcpu=pantherlake and -mcpu=clearwaterforest are now supported. -mapxf is supported. Marking global variables with code_model = \"small\"/\"large\" in the IR now overrides the global code model to allow 32-bit relocations or require 64-bit relocations to the global variable. The medium code model’s code generation was audited to be more similar to the small code model where possible. Changes to the OCaml bindings Changes to the Python bindings The python bindings have been removed. Changes to the C API Added LLVMGetTailCallKind and LLVMSetTailCallKind to allow getting and setting tail, musttail, and notail attributes on call instructions. The following functions for creating constant expressions have been removed, because the underlying constant expressions are no longer supported. Instead, an instruction should be created using the LLVMBuildXYZ APIs, which will constant fold the operands if possible and create an instruction otherwise: LLVMConstAnd LLVMConstOr LLVMConstLShr LLVMConstAShr LLVMConstZExt LLVMConstSExt LLVMConstZExtOrBitCast LLVMConstSExtOrBitCast LLVMConstIntCast LLVMConstFPTrunc LLVMConstFPExt LLVMConstFPToUI LLVMConstFPToSI LLVMConstUIToFP LLVMConstSIToFP LLVMConstFPCast Added LLVMCreateTargetMachineWithOptions, along with helper functions for an opaque option structure, as an alternative to LLVMCreateTargetMachine. The option structure exposes an additional setting (i.e., the target ABI) and provides default values for unspecified settings. Added LLVMGetNNeg and LLVMSetNNeg for getting/setting the new nneg flag on zext instructions, and LLVMGetIsDisjoint and LLVMSetIsDisjoint for getting/setting the new disjoint flag on or instructions. Added the following functions for manipulating operand bundles, as well as building call and invoke instructions that use operand bundles: LLVMBuildCallWithOperandBundles LLVMBuildInvokeWithOperandBundles LLVMCreateOperandBundle LLVMDisposeOperandBundle LLVMGetNumOperandBundles LLVMGetOperandBundleAtIndex LLVMGetNumOperandBundleArgs LLVMGetOperandBundleArgAtIndex LLVMGetOperandBundleTag Added LLVMGetFastMathFlags and LLVMSetFastMathFlags for getting/setting the fast-math flags of an instruction, as well as LLVMCanValueUseFastMathFlags for checking if an instruction can use such flags Changes to the CodeGen infrastructure A new debug type isel-dump is added to show only the SelectionDAG dumps after each ISel phase (i.e. -debug-only=isel-dump). This new debug type can be filtered by function names using -filter-print-funcs=<function names>, the same flag used to filter IR dumps after each Pass. Note that the existing -debug-only=isel will take precedence over the new behavior and print SelectionDAG dumps of every single function regardless of -filter-print-funcs’s values. PrologEpilogInserter no longer supports register scavenging during forwards frame index elimination. Targets should use backwards frame index elimination instead. RegScavenger no longer supports forwards register scavenging. Clients should use backwards register scavenging instead, which is preferred because it does not depend on accurate kill flags. Changes to the Metadata Info Added a new loop metadata !{!”llvm.loop.align”, i32 64} Changes to the Debug Info Changes to the LLVM tools llvm-symbolizer now treats invalid input as an address for which source information is not found. Fixed big-endian support in llvm-symbolizer’s DWARF location parser. llvm-readelf now supports --extra-sym-info (-X) to display extra information (section name) when showing symbols. llvm-nm now supports the --line-numbers (-l) option to use debugging information to print symbols’ filenames and line numbers. llvm-symbolizer and llvm-addr2line now support addresses specified as symbol names. llvm-objcopy now supports --gap-fill and --pad-to options, for ELF input and binary output files only. Supported parsing XCOFF auxiliary symbols in obj2yaml. llvm-ranlib now supports -X on AIX to specify the type of object file ranlib should examine. llvm-nm now supports --export-symbol to ignore the import symbol file. llvm-rc and llvm-windres now accept file path references in .rc files concatenated from multiple string literals. The llvm-windres option --preprocessor now resolves its argument in the PATH environment variable as expected, and options passed with --preprocessor-arg are placed before the input file as they should be. The llvm-windres option --preprocessor has been updated with the breaking behaviour change from GNU windres from binutils 2.36, where the whole argument is considered as one path, not considered as a sequence of tool name and parameters. Changes to LLDB SBWatchpoint::GetHardwareIndex is deprecated and now returns -1 to indicate the index is unavailable. Methods in SBHostOS related to threads have had their implementations removed. These methods will return a value indicating failure. SBType::FindDirectNestedType function is added. It’s useful for formatters to quickly find directly nested type when it’s known where to search for it, avoiding more expensive global search via SBTarget::FindFirstType. lldb-vscode was renamed to lldb-dap and and its installation instructions have been updated to reflect this. The underlying functionality remains unchanged. The mte_ctrl register can now be read from AArch64 Linux core files. LLDB on AArch64 Linux now supports debugging the Scalable Matrix Extension (SME) and Scalable Matrix Extension 2 (SME2) for both live processes and core files. For details refer to the AArch64 Linux documentation. LLDB now supports symbol and binary acquisition automatically using the DEBUFINFOD protocol. The standard mechanism of specifying DEBUFINOD servers in the DEBUGINFOD_URLS environment variable is used by default. In addition, users can specify servers to request symbols from using the LLDB setting plugin.symbol-locator.debuginfod.server_urls, override or adding to the environment variable. When running on AArch64 Linux, lldb-server now provides register field information for the following registers: cpsr, fpcr, fpsr, svcr and mte_ctrl. (lldb) register read cpsr cpsr = 0x80001000 = (N = 1, Z = 0, C = 0, V = 0, SS = 0, IL = 0, <...> This is only available when lldb is built with XML support. Where possible the CPU’s capabilities are used to decide which fields are present, however this is not always possible or entirely accurate. If in doubt, refer to the numerical value. On Windows, LLDB can now read the thread names. Changes to Sanitizers HWASan now defaults to detecting use-after-scope bugs. Changes to the Profile Runtime Public header profile/instr_prof_interface.h is added to declare four API functions to fine tune profile collection. Other Changes The Flags field of llvm::opt::Option has been split into Flags and Visibility to simplify option sharing between various drivers (such as clang, clang-cl, or flang) that rely on Clang’s Options.td. Overloads of llvm::opt::OptTable that use FlagsToInclude have been deprecated. There is a script and instructions on how to resolve conflicts - see https://reviews.llvm.org/D157150 and https://reviews.llvm.org/D157151 for details. On Linux, FreeBSD, and NetBSD, setting the environment variable LLVM_ENABLE_SYMBOLIZER_MARKUP causes tools to print stacktraces using Symbolizer Markup. This works even if the tools have no embedded symbol information (i.e. are fully stripped); llvm-symbolizer can symbolize the markup afterwards using debuginfod. External Open Source Projects Using LLVM 15 A project… Additional Information A wide variety of additional information is available on the LLVM web page, in particular in the documentation section. The web page also contains versions of the API documentation which is up-to-date with the Git version of the source code. You can access versions of these documents specific to this release by going into the llvm/docs/ directory in the LLVM tree. If you have any questions or comments about LLVM, please feel free to contact us via the Discourse forums.",
        "crawl_status": "success"
      },
      {
        "library_name": "LLVM",
        "url": "https://releases.llvm.org/16.0.0/docs/ReleaseNotes.html",
        "version": "Unknown version",
        "title": "LLVM 16.0.0 Release Notes — LLVM 16.0.0 documentation",
        "release_date": "Unknown release date",
        "content": "Introduction This document contains the release notes for the LLVM Compiler Infrastructure, release 16.0.0. Here we describe the status of LLVM, including major improvements from the previous release, improvements in various subprojects of LLVM, and some of the current users of the code. All LLVM releases may be downloaded from the LLVM releases web site. For more information about LLVM, including information about the latest release, please check out the main LLVM web site. If you have questions or comments, the Discourse forums is a good place to ask them. Note that if you are reading this file from a Git checkout or the main LLVM web page, this document applies to the next release, not the current one. To see the release notes for a specific release, please see the releases page. Non-comprehensive list of changes in this release The readnone calls which are crossing suspend points in coroutines will not be merged. Since readnone calls may access thread id and thread id is not a constant in coroutines. This decision may cause unnecessary performance regressions and we plan to fix it in later versions. The LoongArch target is promoted to “official” (see below for more details). … Update on required toolchains to build LLVM LLVM is now built with C++17 by default. This means C++17 can be used in the code base. The previous “soft” toolchain requirements have now been changed to “hard”. This means that the the following versions are now required to build LLVM and there is no way to suppress this error. GCC >= 7.1 Clang >= 5.0 Apple Clang >= 10.0 Visual Studio 2019 >= 16.7 With LLVM 16.x we will raise the version requirement of CMake used to build LLVM. The new requirements are as follows: CMake >= 3.20.0 In LLVM 16.x this requirement will be “soft”, there will only be a diagnostic. With the release of LLVM 17.x this requirement will be hard and LLVM developers can start using CMake 3.20.0 features, making it impossible to build with older versions of CMake. Changes to the LLVM IR The readnone, readonly, writeonly, argmemonly, inaccessiblememonly and inaccessiblemem_or_argmemonly function attributes have been replaced by a single memory(...) attribute. The old attributes may be mapped to the new one as follows: readnone -> memory(none) readonly -> memory(read) writeonly -> memory(write) argmemonly -> memory(argmem: readwrite) argmemonly readonly -> memory(argmem: read) argmemonly writeonly -> memory(argmem: write) inaccessiblememonly -> memory(inaccessiblemem: readwrite) inaccessiblememonly readonly -> memory(inaccessiblemem: read) inaccessiblememonly writeonly -> memory(inaccessiblemem: write) inaccessiblemem_or_argmemonly -> memory(argmem: readwrite, inaccessiblemem: readwrite) inaccessiblemem_or_argmemonly readonly -> memory(argmem: read, inaccessiblemem: read) inaccessiblemem_or_argmemonly writeonly -> memory(argmem: write, inaccessiblemem: write) The constant expression variants of the following instructions has been removed: fneg Target extension types have been added, which allow targets to have types that need to be preserved through the optimizer, but otherwise are not introspectable by target-independent optimizations. Added uinc_wrap and udec_wrap operations to atomicrmw. Renamed llvm.flt.rounds intrinsic to llvm.get.rounding. Changes to building LLVM Changes to TableGen Changes to Interprocedural Optimizations Function Specialization has been integrated into IPSCCP. Specialization of functions has been enabled by default at all optimization levels except Os, Oz. This has exposed a mis-compilation in SPEC/CINT2017rate/502.gcc_r when built via the LLVM Test Suite with both LTO and PGO enabled, but without the option -fno-strict-aliasing. Changes to the AArch64 Backend Added support for the Cortex-A715 CPU. Added support for the Cortex-X3 CPU. Added support for the Neoverse V2 CPU. Added support for assembly for RME MEC (Memory Encryption Contexts). Added codegen support for the Armv8.3 Complex Number extension. Implemented Function Multi Versioning in accordance with Arm C Language Extensions specification. Currently in Beta state. Changes to the AMDGPU Backend Changes to the ARM Backend Support for targeting Armv2, Armv2A, Armv3 and Armv3M has been removed. LLVM did not, and was not ever likely to generate correct code for those architecture versions so their presence was misleading. Added codegen support for the complex arithmetic instructions in MVE. Added Armv4 and Armv4T compatible thunks. LLD will no longer generate BX instructions for Armv4 or BLX instructions for either Armv4 or Armv4T. Armv4T is now fully supported. Added compiler-rt builtins support for Armv4T, Armv5TE and Armv6. Changes to the AVR Backend … Changes to the DirectX Backend Changes to the Hexagon Backend The Hexagon backend now support V71 and V73 ISA. Changes to the LoongArch Backend The LoongArch target is no longer “experimental”! It’s now built by default, rather than needing to be enabled with LLVM_EXPERIMENTAL_TARGETS_TO_BUILD. The backend has full codegen support for the base (both integer and floating-point) instruction set and it conforms to psABI v2. Testing has been performed with Linux, including native compilation of a large corpus of Linux applications. Support GHC calling convention. Initial JITLink support is added. (D141036) Changes to the MIPS Backend … Changes to the PowerPC Backend Common PowerPC improvements Supported selecting floating point and ‘sync’ family of instructions in GlobalISel PowerPC. Comparison operations are now optimized by record form instructions. __test_data_class built-in now accepts __float128 arguments for Power9 and newer. Fixed incorrect fence insertion in atomic FP operations on PowerPC. Fixed alignment of aggregate with smaller size than register in variadic function on PowerPC 64-bit. CTR loops on PowerPC are now generated after instruction selection. Enabled track-subreg-liveness option by default. Store of link register in function prologue are now generated in location after stack pointer update instructions. Code generation improvements for atomic operations, vector permutes, and constant materialization for some floating point constants. Implement new register classes and a number of new instructions for mcpu=future. Implement byte reverse instructions, and VSX Scalar Quad Precision compares for mcpu=pwr10. Improved load-store forwarding for big-endian mode. Bug fixes. AIX improvements Supported TOC-data, overflow section, R_RBR relocation in XCOFF. Fixed behavior of function sections, cold attribute, and handling of TLS symbols’ name prefixes in XCOFF. Fixed redundant spill and reload on AIX 64-bit when paired vector are enabled. Disabled location attribution generation of TLS variables. Fixed the mapping of built-in functions __builtin_frexpl, __builtin_ldexpl, and __builtin_modfl to libm routines in 64-bit long double mode. Implemented libunwind function _Unwind_FindEnclosingFunction using traceback table on AIX. Changed to use non-unique implementation for typeinfo comparison. Codegen work done for -pg to generate correct calls to __mcount. Changes to the RISC-V Backend User Guide for RISC-V Target was introduced to document the status of support within LLVM for various RISC-V instruction set extensions. Support for the unratified Zbe, Zbf, Zbm, Zbp, Zbr, and Zbt extensions have been removed. i32 is now a native type in the datalayout string. This enables LoopStrengthReduce for loops with i32 induction variables, among other optimizations. MC layer support was added for the experimental Zca, Zcd, Zcf, Zihintntl, Ztso, and Zawrs extensions. Codegen support was added for the experimental Zca extension and for the Zfhmin extension. MC layer and codegen support was added for the custom XVentanaCondOps and XTHeadVdot extensions. A target feature was introduced to force-enable atomics. Support was added for lowering HWASAN intrinsics. The short forward branch optimisation beneficial to the SiFive Series 7 was implemented. A Syntacore SCR1 CPU model was added. Various codegen improvements. Changes to the SystemZ Backend The datalayout string now only depends on the target triple as expected. The GNU attribute for a visible vector ABI is now emitted. Align 128 bit integers to 8 bytes only, per the ABI. Changes to the WebAssembly Backend … Changes to the Windows Target For MinGW, generate embedded -exclude-symbols: directives for symbols with hidden visibility, omitting them from automatic export of all symbols. This roughly makes hidden visibility work like it does for other object file formats. When using multi-threaded LLVM tools (such as LLD) on a Windows host with a large number of processors or CPU sockets, previously the LLVM ThreadPool would span out threads to use all processors. Starting with Windows Server 2022 and Windows 11, the behavior has changed, the OS now spans out threads automatically to all processors. This also fixes an affinity mask issue. (D138747) When building LLVM and related tools for Windows with Clang in MinGW mode, hidden symbol visiblity is now used to reduce the number of exports in builds with dylibs (LLVM_BUILD_LLVM_DYLIB or LLVM_LINK_LLVM_DYLIB), making such builds more manageable without running into the limit of number of exported symbols. AArch64 SEH unwind info generation bugs have been fixed; there were minor cases of mismatches between the generated unwind info and actual prologues/epilogues earlier in some cases. AArch64 SEH unwind info is now generated correctly for the AArch64 security features BTI (Branch Target Identification) and PAC (Pointer Authentication Code). In particular, using PAC with older versions of LLVM would generate code that would fail to unwind at runtime, if the host actually would use the pointer authentication feature. Fixed stack alignment on Windows on AArch64, for stack frames with a large enough allocation that requires stack probing. Changes to the X86 Backend Add support for the RDMSRLIST and WRMSRLIST instructions. Add support for the WRMSRNS instruction. Support ISA of AMX-FP16 which contains tdpfp16ps instruction. Support ISA of CMPCCXADD. Support ISA of AVX-IFMA. Support ISA of AVX-VNNI-INT8. Support ISA of AVX-NE-CONVERT. -mcpu=raptorlake, -mcpu=meteorlake and -mcpu=emeraldrapids are now supported. -mcpu=sierraforest, -mcpu=graniterapids and -mcpu=grandridge are now supported. Changes to the OCaml bindings Changes to the C API The following functions for creating constant expressions have been removed, because the underlying constant expressions are no longer supported. Instead, an instruction should be created using the LLVMBuildXYZ APIs, which will constant fold the operands if possible and create an instruction otherwise: LLVMConstFNeg The following deprecated functions have been removed, because they are incompatible with opaque pointers. Use the new functions accepting a separate function/element type instead. LLVMBuildLoad -> LLVMBuildLoad2 LLVMBuildCall -> LLVMBuildCall2 LLVMBuildInvoke -> LLVMBuildInvoke2 LLVMBuildGEP -> LLVMBuildGEP2 LLVMBuildInBoundsGEP -> LLVMBuildInBoundsGEP2 LLVMBuildStructGEP -> LLVMBuildStructGEP2 LLVMBuildPtrDiff -> LLVMBuildPtrDiff2 LLVMConstGEP -> LLVMConstGEP2 LLVMConstInBoundsGEP -> LLVMConstInBoundsGEP2 LLVMAddAlias -> LLVMAddAlias2 Changes to the FastISel infrastructure … Changes to the DAG infrastructure Changes to the Metadata Info Add Module Flags Metadata stack-protector-guard-symbol which specify a symbol for addressing the stack-protector guard. Changes to the Debug Info Previously when emitting DWARF v4 and tuning for GDB, llc would use DWARF v2’s DW_AT_bit_offset and DW_AT_data_member_location. llc now uses DWARF v4’s DW_AT_data_bit_offset regardless of tuning. Support for DW_AT_data_bit_offset was added in GDB 8.0. For earlier versions, you can use llc’s -dwarf-version=3 option to emit compatible DWARF. When emitting CodeView debug information, LLVM will now emit S_CONSTANT records for variables optimized into a constant via the SROA and SCCP passes. (D138995) DW_LANG_C11 now respects -gstrict-dwarf option. Changes to the LLVM tools llvm-readobj --elf-output-style=JSON no longer prefixes each JSON object with the file name. Previously, each object file’s output looked like \"main.o\":{\"FileSummary\":{\"File\":\"main.o\"},...} but is now {\"FileSummary\":{\"File\":\"main.o\"},...}. This allows each JSON object to be parsed in the same way, since each object no longer has a unique key. Tools that consume llvm-readobj’s JSON output should update their parsers accordingly. llvm-readobj now supports a new option --loader-section-header to display the loader section header of XCOFF object tiles llvm-readobj now supports a new option --loader-section-header to display the symbol table of the loader section of XCOFF object files llvm-readobj now supports a new option --loader-section-header to display relocation entries in the loader section of XCOFF object files llvm-readobj now supports a new option --exception-section to display exception section entries from XCOFF object files llvm-objdump now uses --print-imm-hex by default, which brings its default behavior closer in line with objdump. llvm-objcopy no longer writes corrupt addresses to empty sections if the input file had a nonzero address to an empty section. llvm-nm now supports the environment variable OBJECT_MODE for the -X option on AIX OS Changes to LLDB Initial support for debugging Linux LoongArch 64-bit binaries. Improvements in COFF symbol handling; previously a DLL (without any other debug info) would only use the DLL’s exported symbols, while it now also uses the full list of internal symbols, if available. Avoiding duplicate DLLs in the runtime list of loaded modules on Windows. Changes to Sanitizers Many Sanitizers (asan, fuzzer, lsan, safestack, scudo, tsan, ubsan) have support for Linux LoongArch 64-bit variant. Some of them may be rudimentary. Other Changes lit no longer supports using substrings of the default target triple as feature names in UNSUPPORTED: and XFAIL: directives. These have been replaced by the target=<triple> feature, and tests can use regex matching to achieve the same effect. For example, UNSUPPORTED: arm would now be UNSUPPORTED: target=arm{{.*}} and XFAIL: windows would now be XFAIL: target={{.*}}-windows{{.*}}. When cross compiling LLVM (or building with LLVM_OPTIMIZED_TABLEGEN), it is now possible to point the build to prebuilt versions of all the host tools with one CMake variable, LLVM_NATIVE_TOOL_DIR, instead of having to point out each individual tool with variables such as LLVM_TABLEGEN, CLANG_TABLEGEN, LLDB_TABLEGEN etc. External Open Source Projects Using LLVM 15 A project… Additional Information A wide variety of additional information is available on the LLVM web page, in particular in the documentation section. The web page also contains versions of the API documentation which is up-to-date with the Git version of the source code. You can access versions of these documents specific to this release by going into the llvm/docs/ directory in the LLVM tree. If you have any questions or comments about LLVM, please feel free to contact us via the Discourse forums.",
        "crawl_status": "success"
      }
    ],
    "expected_years": [
      2024,
      2025,
      2023
    ],
    "actual_years": [],
    "years_extracted": [
      null,
      null,
      null
    ],
    "reason": "年份分布不符合要求（2023、2024、2025各一个）"
  },
  {
    "library": "nlohmann-json",
    "entries": [
      {
        "library_name": "nlohmann-json",
        "url": "https://github.com/nlohmann/json/releases/tag/v3.11.3",
        "version": "v3.11.3",
        "title": "Release JSON for Modern C++ version 3.11.3 · nlohmann/json · GitHub",
        "release_date": "2023-11-28T21:38:09Z",
        "content": "Release date: 2023-11-28\nSHA-256: 9bea4c8066ef4a1c206b2be5a36302f8926f7fdc6087af5d20b417d0cf103ea6 (json.hpp), a22461d13119ac5c78f205d3df1db13403e58ce1bb1794edc9313677313f4a9d (include.zip), d6c65aca6b1ed68e7a182f4757257b107ae403032760ed6ef121c9d55e81757d (json.tar.xz)\nSummary\nThis release fixes some bugs found in the\n3.11.2\nrelease.\nAll changes are backward-compatible.\n💰 Note you can\nsupport this project\nvia\nGitHub sponsors\nor\nPayPal\n.\n✨ New Features\nAllow\ncustom base class\nas node customization point. This adds an additional template parameter which allows to set a custom base class for\nnlohmann::json\n. This class serves as an extension point and allows to add functionality to json node. Examples for such functionality might be metadata or additional member functions (e.g., visitors) or other application specific code. By default the parameter is set to\nvoid\nand an empty base class is used. In this case the library behaves as it already did.\n#3110\nAdd more specific parse error message when attempting to\nparse empty input\n.\n#4037\n#4180\nAdd serialization-only user defined type\nmacros\n(\nNLOHMANN_DEFINE_TYPE_NON_INTRUSIVE_ONLY_SERIALIZE\nand\nNLOHMANN_DEFINE_TYPE_INTRUSIVE_ONLY_SERIALIZE\n).\n#3816\nAdd\nBazel\nbuild support. If you are using\nBazel\nyou can simply reference this repository using\nhttp_archive\nor\ngit_repository\nand depend on\n@nlohmann_json//:json\n.\n#3709\nSupport Apple's Swift Package Manager.\n#4010\n🐛 Bug Fixes\nAdjust CMake files to accept\nNEW\nCMake policies\nup to CMake 3.14. This fixes a nasty deprecation warning that \"Compatibility with CMake < 3.5 will be removed from a future version of CMake\".\n#4076\n#4112\nFix CMake header path in install with custom\nCMAKE_INSTALL_INCLUDEDIR\n.\n#4194\nAdd missing\n<numeric>\nheader include.\n#3717\n#3718\n#3719\nReplace uses of\nINT_MIN\n/\nINT_MAX\n, etc. with\nstd::numeric_limits\nand consistently use\nstd\n-namespaced integer types to make library work with newer GCC versions.\n#3722\n#3723\nAdd missing files (\njson_fwd.hpp\nand Bazel build files) to release artifact\ninclude.zip\n.\n#3727\n#3728\nFix 'declaration hides global declaration' warning.\n#3751\nFix natvis XML.\n#3858\n#3863\nFix warning about moved from object.\n#3805\n#3889\nRemove a magic number to fix a warning.\n#3837\n#3888\nFix debug pretty-printer by checking if match is valid before accessing group.\n#3919\n#3920\nFix custom allocators by defining missing\nrebind\ntype.\n#3895\n#3927\nPrevent memory leak when exception is thrown in\nadl_serializer::to_json\n#3881\n#3901\nFix Clang-Tidy warnings.\n#4047\nFix init-list construction when\nsize_type\nis not\nint\n.\n#4140\nFix deprecation warning \"identifier\n_json\npreceded by whitespace in a literal operator declaration\".\n#4129\n#4161\nFix compile error with\n_HAS_STATIC_RTTI=0\n.\n#4046\nFix char_traits deprecation warning \"\nchar_traits<unsigned char>\nis deprecated:\nchar_traits<T>\nfor\nT\nnot equal to\nchar\n,\nwchar_t\n,\nchar8_t\n,\nchar16_t\nor\nchar32_t\nis non-standard\".\n#4163\n#4179\n🔨 Further Changes\nCI\nUse official\nClang\n/\nGCC\nDocker containers in the CI.\n#3703\nAdd workflow to check if the source files are amalgamated.\n#3693\nFix CI build.\n#3724\n#3862\n#3978\n#3985\n#4025\n#4083\n#4160\n#4196\n#4215\nUse Clang 15.\n#3822\n#3876\nAdd\nCIFuzz\nCI GitHub action.\n#3845\nFix MinGW script and CI.\n#3892\n#4175\nRemoved lgtm and DroneCI and added\nCirrus CI\n.\n#3890\n#3906\n#3935\n#3937\nSet minimal permissions to Github Workflows.\n#3971\n#3972\nRefactor amalgamation workflow to avoid dangerous use of pull_request_target.\n#3945\n#3969\nDocumentation\nAdd\nmigration guide\nto replace deprecated library functions.\n#3702\n#3887\nAdd dark mode toggle to documentation\n#3726\nFix typos in documentation.\n#3748\n#3767\n#3902\n#3932\n#3951\n#4109\n#4126\n#4143\n#4149\n#4159\n#4173\nUpdate Codacy link.\n#3740\nBump documentation tool versions.\n#3781\n#3872\n#3891\n#3934\nAdd vcpkg port version badge.\n#3988\nAdd to\nCONTRIBUTING.md\nthat\nmake pretty\nis required for test updates.\n#4045\nUse template get instead of get in examples.\n#3827\n#4038\n#4039\nCapture exceptions by\nconst&\nin docs.\n#4099\nFix source highlighting in user defined type macros docs.\n#4169\nTests\nUse\nstd::ranges::equals\nfor range comparisons in test case.\n#3927\n#3950\nAdd more algorithm tests to\nunit-algorithm.cpp\n.\n#4044\n🔥 Deprecated functions\nThis release does not deprecate any function. See the\nmigration guide\nfor help adjusting your code for future versions.\nThe following functions have been deprecated in earlier versions and will be removed in the next major version (i.e., 4.0.0):\nThe function\niterator_wrapper\nis deprecated. Please use the member function\nitems()\ninstead.\nFunctions\nfriend std::istream& operator<<(basic_json&, std::istream&)\nand\nfriend std::ostream& operator>>(const basic_json&, std::ostream&)\nare deprecated. Please use\nfriend std::istream&  operator>>(std::istream&, basic_json&)\nand\nfriend operator<<(std::ostream&, const basic_json&)\ninstead.\nPassing iterator pairs or pointer/length pairs to parsing functions (\nbasic_json::parse\n,\nbasic_json::accept\n,\nbasic_json::sax_parse\n,\nbasic_json::from_cbor\n,\nbasic_json::from_msgpack\n,\nbasic_json::from_ubjson\n,\nbasic_json::from_bson\n) via initializer lists is deprecated. Instead, pass two iterators; for instance, call\nbasic_json::from_cbor(ptr, ptr+len)\ninstead of\nbasic_json::from_cbor({ptr, len})\n.\nThe implicit conversion from JSON Pointers to string (\njson_pointer::operator string_t\n) is deprecated. Use\njson_pointer::to_string\ninstead.\nComparing JSON Pointers with strings via\noperator==\nand\noperator!=\nhave been deprecated. To compare a\njson_pointer\np\nwith a string\ns\n, convert\ns\nto a\njson_pointer\nfirst and use\njson_pointer::operator==\nor\njson_pointer::operator!=\n.\n#3684\nAll deprecations are annotated with\nHEDLEY_DEPRECATED_FOR\nto report which function to use instead.",
        "crawl_status": "success"
      },
      {
        "library_name": "nlohmann-json",
        "url": "https://github.com/nlohmann/json/releases/tag/v3.11.2",
        "version": "v3.11.2",
        "title": "Release JSON for Modern C++ version 3.11.2 · nlohmann/json · GitHub",
        "release_date": "2022-08-12T13:06:34Z",
        "content": "Release date: 2022-08-12\nSHA-256: 665fa14b8af3837966949e8eb0052d583e2ac105d3438baba9951785512cf921 (json.hpp), e5c7a9f49a16814be27e4ed0ee900ecd0092bfb7dbfca65b5a421b774dccaaed (include.zip), 8c4b26bf4b422252e13f332bc5e388ec0ab5c3443d24399acb675e68278d341f (json.tar.xz)\nSummary\nThis release fixes some bugs found in the\n3.11.1\nrelease. Furthermore, the  of the namespace library has been re-structured.\nAll changes are backward-compatible.\n💰 Note you can\nsupport this project\nvia\nGitHub sponsors\nor\nPayPal\n.\n🐛 Bug Fixes\nFix the\nvalue\nfunction which was broken for strings, size types, and\nnullptr\nin release 3.11.0.\n#3652\n#3655\n#3663\nFix the\njson_fwd.hpp\nheader to be self-contained and add it to the single-header release.\n#3656\n#3679\n#3687\nFix regression that broke using\njson_pointer\nas key in associative containers.\n#3680\n#3685\nAdd missing constraint to deprecated JSON Pointer overloads of\ncontains\nand\nat\n.\n#3658\n#3681\nFix comparison between\njson_pointer\nand strings with\n==\nand\n!=\n. These comparisons worked in 3.10.5, but were broken in 3.11.0 and 3.11.1.\n#3654\n#3664\nFix\nto_json\nconversion of\nstd::vector<bool>::reference\nand\nstd::vector<bool>::const_reference\nfor STLs where these are the same as\nbasic_json::boolean_t&\nand\nbasic_json::boolean_t\n, respectively.\n#3677\n#3678\n⚡ Improvements\nRestructure inline namespace and allow version component to be disabled. See\ndocumentation\n.\n#3683\n#3696\n#3697\n#3698\nAvoid heap allocations in\nBJData\nparser.\n#3637\n🔨 Further Changes\nDocumentation\nPublish documentation on every push to\ndevelop\nbranch.\n#3660\n#3673\nAdd missing examples for the\npublic API\n.\n#3672\n#3686\nFix typo in\njson_pointer\ndocumentation.\n#3692\nCommunity\nAdd a badge for the\nDiscord chat\nto the README file. The goal of that additional communication channel beyond\nthe existing ones\nis to quickly coordinate between the contributors.\n#3651\nComplete contributor list.\n#3662\n#3670\nCI\nRemove the\nmacos-10.15\nimage from the CI as it is removed by GitHub Actions.\n#3612\n#3615\n#3626\nRemove hardcoded paths in Ubuntu workflow.\n#3626\nOnly trigger AppVeyor builds if relevant files have been changed.\n#3626\nFix CodeQL warning.\n#3626\nHarmonize naming of GitHub Actions jobs.\n#3661\nAdd labeler action to automatically add PR labels based on the changed files.\n#3671\n#3674\n#3675\nLint API documentation in the CI.\n#3672\nAdd local\nLGTM\nconfiguration and suppress warnings on third-party scripts.\n#3643\n🔥 Deprecated functions\nThis release deprecates comparing JSON Pointers with strings via\noperator==\nand\noperator!=\n. To compare a\njson_pointer\np\nwith a string\ns\n, convert\ns\nto a\njson_pointer\nfirst and use\njson_pointer::operator==\nor\njson_pointer::operator!=\n.\n#3684\nThe following functions have been deprecated in earlier versions and will be removed in the next major version (i.e., 4.0.0):\nThe function\niterator_wrapper\nis deprecated. Please use the member function\nitems()\ninstead.\nFunctions\nfriend std::istream& operator<<(basic_json&, std::istream&)\nand\nfriend std::ostream& operator>>(const basic_json&, std::ostream&)\nare deprecated. Please use\nfriend std::istream&  operator>>(std::istream&, basic_json&)\nand\nfriend operator<<(std::ostream&, const basic_json&)\ninstead.\nPassing iterator pairs or pointer/length pairs to parsing functions (\nbasic_json::parse\n,\nbasic_json::accept\n,\nbasic_json::sax_parse\n,\nbasic_json::from_cbor\n,\nbasic_json::from_msgpack\n,\nbasic_json::from_ubjson\n,\nbasic_json::from_bson\n) via initializer lists is deprecated. Instead, pass two iterators; for instance, call\nbasic_json::from_cbor(ptr, ptr+len)\ninstead of\nbasic_json::from_cbor({ptr, len})\n.\nThe implicit conversion from JSON Pointers to string (\njson_pointer::operator string_t\n) is deprecated. Use\njson_pointer::to_string\ninstead.\nAll deprecations are annotated with\nHEDLEY_DEPRECATED_FOR\nto report which function to use instead.",
        "crawl_status": "success"
      },
      {
        "library_name": "nlohmann-json",
        "url": "https://github.com/nlohmann/json/releases/tag/v3.12.0",
        "version": "v3.12.0",
        "title": "Release JSON for Modern C++ version 3.12.0 · nlohmann/json · GitHub",
        "release_date": "2025-04-11T08:43:39Z",
        "content": "Release date: 2025-04-11\nSHA-256: aaf127c04cb31c406e5b04a63f1ae89369fccde6d8fa7cdda1ed4f32dfc5de63 (json.hpp), b8cb0ef2dd7f57f18933997c9934bb1fa962594f701cd5a8d3c2c80541559372 (include.zip), 42f6e95cad6ec532fd372391373363b62a14af6d771056dbfc86160e6dfff7aa (json.tar.xz)\nSummary\nThis release fixes some bugs found in the\n3.11.3\nrelease and adds some new features.\nAll changes are backward-compatible.\n💰 Note you can\nsupport this project\nvia\nGitHub sponsors\nor\nPayPal\n.\nKey updates and enhancements\nDiagnostic byte positions\n: A new macro,\nJSON_DIAGNOSTIC_POSITIONS\n, introduces member functions to query the\nbyte positions\nof values in the input they were parsed from. When enabled, this information is also included in exceptions to help pinpoint errors.\n#4517\n#4455\n#4570\n#4569\n#4572\n#4571\n#4579\n#4585\n#4561\nEnhanced conversion macros\n: The\nconversion macros for arbitrary types\nnow include several upgrades:\nAll macros are\ntemplated\n, supporting\njson\n,\nordered_json\n, and any other\nbasic_json\nspecialization.\n#4597\n#2528\n#4377\n#2532\n#2843\n#3810\n#4608\nDerived classes\ncan now be seamlessly converted to/from JSON using the new\nNLOHMANN_DEFINE_DERIVED_TYPE_*\nmacros.\n#4033\n#2199\n#4562\nSupport for\nstd::optional\n: The library now supports conversions from/to\nstd::optional\ntypes when compiled with C++17.\n#1749\n#4036\nFlexible string compatibility\n: Functions\npatch\n,\ndiff\n, and\nflatten\nnow work with arbitrary string types.\n#4536\n#4134\n#4613\n#4019\nBinary format enhancements\n:\nThe\nBJData mapping\nnow supports draft 3, including optimized binary array types.\n#4513\n#4588\nThe\nBSON mapping\nhas added support for unsigned 64-bit integers.\n#4590\n#4535\n#3894\nThe\nget_number\nfunction used in the binary format implementations has been optimized to read multiple bytes at once.\n#4391\nMultidimensional array conversion\n: Multidimensional C-style arrays can now be directly converted to JSON.\n#4262\n#4248\nFilesystem paths in UTF-8\n: The conversions from/to\nstd::filesystem::path\nare now encoded to UTF-8 strings by default on all operating systems.\n#4271\n#4631\nCMake 4.0 support\n. By adjusting the CMake minimal version to 3.5, CMake 4.0 can be used without warning or error.\n#4709\nChanges and fixes\nThe\niteration_proxy\nis now a\nstd::forward_iterator\ninstead of just an\nstd::input_iterator\n. This allows more use cases when\nitems()\nis fed into C++20\nstd::views\n. The iterator always satisfied all requirements for a forward iterator, but was exposed as only an input iterator by the used iterator tag.\n#4371\n#4372\nFix the conversion from enums with unsigned underlying type to JSON.\n#4236\n#4237\nFix GDB pretty printer which was broken since\nm_data\nadded.\n#4343\n#4309\nUpdate natvis to reflect 3.11.3 and the current structure of\nbasic_json\n.\n#4451\n#4438\n#4438\nFix crash when passing\nnullptr\nto\nparse\nfunction expecting\nFILE*\n. Instead, now an exception is thrown.\n#4485\n#4487\nFix number parsing such that integers are not parsed to float when\nEINTR\nset in\nerrno\n.\n#4506\nFix\nSAX output of\nnumber_float\nto be locale-independent.\n#4505\n#4084\nFix iterators to allow comparing default-initialized iterators.\n#4512\n#4493\nFix return value of\nget_ptr\nfor unsigned integers.\n#4525\n#4475\nFix regression of\n#2755\nand replace\nEOF\nwith\nchar_traits\n.\n#4532\nFix\nextended diagnostics\nto not trigger an assertion.\n#4537\n#3915\nFix\nNLOHMANN_DEFINE_TYPE_INTRUSIVE_WITH_DEFAULT\nthrow an exception with an empty json\n#4507\n#4508\nModernize integer comparison.\n#4577\n#4559\nSerialize empty tuple into\n[]\ninstead of\nnull\n.\n#4594\n#4530\nWarnings\nThe\nquality assurance\npage gives an overview of the warning flags used during the tests.\nCompiler warnings\nSuppress\nweak-vtables\nwarning for exceptions.\n#4500\n#4087\nAdd 40+ GCC warning flags for GCC 14.2.0.\n#4524\nFix ignored attribute warning during build.\n#4670\nAdd explanation for suppressed CodeQL issues.\n#4362\n#4361\nMove compiler flags to separate CMake files (\nGCC\n,\nClang\n).\n#4560\nClang-Tidy\nSuppress warnings\nmodernize-use-std-numbers\n,\nreadability-redundant-member-init\n, and\nbugprone-unused-local-non-trivial-variable\n.\n#4276\nSuppress warnings\nmodernize-type-traits\nand\nmodernize-avoid-c-arrays\nin\nNLOHMANN_JSON_SERIALIZE_ENUM\n.\n#4497\n#3924\nSuppress warning\nboost-use-ranges\nas we do not want to rely on Boost.\n#4489\nSuppress warning\nmodernize-use-designated-initializers\nas designated initializers are a C++20 feature.\n#4489\nSuppress warning\nmodernize-use-ranges\nas ranges are a C++20 feature.\n#4489\nSuppress warning\nclang-analyzer-webkit.NoUncountedMemberChecker\nas we are using pointers internally.\n#4701\nFix warning\nmodernize-use-integer-sign-comparison\n.\n#4558\nBuild\nCMake\nAdjust CMake minimal version to 3.5.\n#4709\nAllow overriding the CMake target name via variable\nNLOHMANN_JSON_TARGET_NAME\n.\n#4483\nAdd CPack support.\n#4459\nAdjust CMake to generate a pkg-config file that follows the pkg-config conventions.\n#4456\nPackage Managers\nRemove\nalwayslink=True\nBazel flag.\n#4396\nImprove Bazel support by switching to Bzlmod.\n#4584\nAdd VisionOS support to Swift Package Manager\nPackage.swift\ndefinition file.\n#4611\nRemove wsjcpp package manager support.\n#4623\nCI\nTests\nAdd test for libstdc++.\n#4495\nSkip enum tests when\nJSON_DisableEnumSerialization=ON\n.\n#4504\n#4384\nAdd a build step to build the documentation.\n#4549\nFix the coverage job.\n#4595\nAdd comment on reproducible builds.\n#4494\n#4496\nInfrastructure\nRemove unsupported\nmacos-11\nimage; the following Xcode versions are no longer tested in the CI: '11.7', '12.4', '12.5.1', '13.0'.\n#4489\nAdd\nmacos-13\nimage to test Xcode versions '14.2', '14.3', '14.3.1', '15.0.1', '15.1', '15.2'.\n#4489\nAdd\nmacos-14\nimage to test Xcode versions '15.3', '15.4'.\n#4489\nAdd\nmacos-15\nimage to test Xcode versions '16.0', '16.1'.\n#4489\nTest GCC versions '4.8', '4.9', '5', '6' on\njson-ci\nimage as these versions are no longer work on the respective\ngcc\nimages (checkout fails).\n#4489\nAdd tests for GCC versions '13', '14'.\n#4489\nAdd tests for Clang versions '16', '17', '18', '19'.\n#4489\nUpdate README with a table of compilers/OS used in the CI.\n#4489\nApply security best practices by StepSecurity.\n#4539\n#4546\n#4058\n#4547\n#4550\n#4551\nUse Dependabot to automatically update GitHub actions and Python tools used in the CI.\n#4489\n#4541\n#4540\n#4543\n#4544\n#4545\n#4542\n#4548\n#4557\n#4567\n#4600\n#4601\n#4602\n#4603\n#4604\n#4615\n#4614\n#4616\n#4617\n#4620\n#4624\n#4625\n#4634\n#4635\n#4646\n#4648\n#4652\n#4659\n#4661\n#4664\n#4665\n#4668\n#4672\n#4680\n#4683\n#4688\n#4689\n#4695\n#4697\n#4698\n#4700\n#4707\n#4711\n#4715\n#4716\n#4718\n#4719\n#4726\nUse\nubuntu-latest\nimage to run Valgrind.\n#4575\nUse Clang image to run iwyu.\n#4574\nAdjust permissions in workflows.\n#4553\nUse Python to install cppcheck.\n#4553\nMove\nrequirements.txt\nfiles for cppcheck, cpplint, and reuse to central location.\n#4553\nAdjust cppcheck call.\n#4553\nAdd code exclusions to source files.\n#4553\nMigrate stalebot to GitHub action.\n#4560\nRemove deprecated\n.lgtm.yml\nfile.\n#4560\nAdd CI steps for C++26.\n#4560\nAdd Xcode 16.2 (macOS) and Clang 3.4 (Ubuntu) action.\n#4560\nSimplify Ubuntu workflow to use\nubuntu-latest\nmore often and reduce dependencies to more exotic containers.\n#4560\nAdd DCO requirement: all commits since January 17, 2025, need to be signed off.\n#4560\nRemove\n.pre-commit-config.yml\nfile.\n#4560\nPull update for\ntests/thirdparty/imapdl/filterbr.py\n.\n#4560\nMake gdb-pretty-printer work with older Python versions.\n#4691\n#4693\nUpdate the REUSE integration.\n#4521\nIndentation and amalgamation\nAdjust and modernize flags for Artistic Style.\n#4277\n#4275\n#4573\nFix deprecation warning in amalgamation CI check.\n#4227\nDocumentation\nThe\ndocumentation website\ncontains all project documentation.\nFixed documentation\nFix version history.\n#4269\n#4310\n#4307\n#4310\nRemove broken link in\nContribution Guidelines\n.\n#4274\n#4486\nFix custom data source example in README.\n#4335\nFix an example to catch an exception by reference.\n#4331\nFix example for JSON Pointer usage.\n#4255\nFix using a wrong function in documentation.\n#4472\nFix for incorrect function name in a documentation example.\n#4342\n#4334\nFix typos.\n#4345\n#4412\n#4565\n#4679\n#4723\nFix style warnings.\n#4516\nFix broken links.\n#4516\n#4560\n#4605\nFix\nci_test_api_documentation\nCI step.\n#4516\nRemove duplicate documentation files.\n#4560\nFix the index file for mkdocs after merging.\n#4517\nFix duplicate keys in navigation.\n#4560\nAdd missing macros in README and link to docs for more info.\n#4582\n#4260\nFix documentation for macros to show correct names.\n#4564\nAdded documentation\nAdd\ncustomer section\nto README.\n#4516\n#4560\nAdd\n”which macro to choose?”\ndecision tree.\n#4560\nAdd comment about iterator invalidation.\n#4289\n#4279\nAdd a note to JetBrains support.\n#4592\nAdd a\ncommunity section\nto the documentation.\n#4560\nDocument non-code files in\nFILES.md\n.\n#4560\nAdd documentation for\nstart_pos\nand\nend_pos\n.\n#4560\nAdd glossary.\n#4560\nAdd newer serialization macros to README.\n#4260\nAdd a note on the derived return type for\nvalue\nfunction.\n#4628\n#4626\nAdd more \"see also\" links.\n#4636\nAdd\nJSON_DIAGNOSTIC_POSITIONS\nto\nmacro feature page\n.\n#4636\nImproved documentation\nUpdate navigation.\n#4516\nExtend documentation of\nparse\nand\naccept\nwith respect to\n#4485\n#4487\n#4516\nUpdate\ncode of conduct\n.\n#4560\nUpdate\ncontribution guidelines\n.\n#4560\nUpdate\npull request template\n.\n#4560\nUpdate\nsecurity policy\n.\n#4560\nUpdate docset table of contents.\n#4560\nOverwork documentation of all serialization macros (cross references, decision table, removed redundancies).\n#4560\nShorten README serialization macro section.\n#4560\nDocument the compilers used in the CI.\n#4560\nAdd a\nquick reference\nto README.\n#4560\nBump the copyright years.\n#4606\nPackage Manager documentation\nExtend the documentation of\npackage managers\nwith more examples.\n#4516\nMove\npackage manager section\nto documentation.\n#4560\nAdd Swift Package Manager and xmake.\n#4560\nAdd an example for Conda.\n#4560\nAdd an overview with logos.\n#4560\nAnnotate Buckaroo, CocoaPods, and wsjcpp as outdated.\n#4560\nDocumentation implementation\nReplace PlantUML by Mermaid.\n#4026\nServe assets (fonts, CSS) locally.\n#4560\nUpdate Python requirements.\n#4516",
        "crawl_status": "success"
      }
    ],
    "expected_years": [
      2024,
      2025,
      2023
    ],
    "actual_years": [
      2025,
      2023
    ],
    "years_extracted": [
      2023,
      null,
      2025
    ],
    "reason": "年份分布不符合要求（2023、2024、2025各一个）"
  },
  {
    "library": "Crow",
    "entries": [
      {
        "library_name": "Crow",
        "url": "https://github.com/CrowCpp/Crow/releases/tag/v1.1.0",
        "version": "v1.1.0",
        "title": "Release v1.1.0 · CrowCpp/Crow · GitHub",
        "release_date": "2024-01-23T19:16:18Z",
        "content": "After a long time this is the first new release, in the last year the team and all the (new) contributors fixed a lot of bugs.\nCore does now only depend on standalone Casio library instead of the big boost dependencies. :)\nThanks to the The E-Dev, the Crow team and all the new contributors.\nWhat's Changed\nFix indentation & numbering in middleware by\n@bryceschober\nin\n#378\nSplit up operator\"\"_method by\n@beached\nin\n#383\nmake multipart robust against ill-formed body, prevents SIGSEGV by\n@hsiegmund\nin\n#385\n#380\n: Update CMake config. by\n@luca-schlecker\nin\n#384\ndocumented CROW_FEATURES by\n@The-EDev\nin\n#392\nFixed issue where SSL websockets wouldn't run due to HTTP upgrade by\n@The-EDev\nin\n#393\nAdd inline decl to CORSRules helpers by\n@dranikpg\nin\n#395\nAdd\nstd::remove_reference\nto CROW_MIDDLEWARES by\n@The-EDev\nin\n#396\nConcatenate log into one string and sending to std::cerr instead of multiple << operator by\n@dhchen\nin\n#404\nHandle unknown static file extensions by\n@danielskeenan\nin\n#411\nAllow compiling on GCC 4.8 by\n@The-EDev\nin\n#399\nFix for SecBug cpp/comparison-with-wider-type by\n@kingster\nin\n#416\napp: static can be an absolute path by\n@joelguittet\nin\n#419\nMultiple small changes by\n@The-EDev\nin\n#424\nCookieparser attributes by\n@dranikpg\nin\n#409\nDocumentation improvements by\n@The-EDev\nin\n#435\nAdd reference to\nCrow\nin websocket connection  by\n@The-EDev\nin\n#432\nFix amalgamate by\n@The-EDev\nin\n#437\nClose websockets when app is terminated by\n@The-EDev\nin\n#269\nAdd extra log when status code is not defined. by\n@konradkar2\nin\n#434\nAdd rudimentary support for websocket max payload by\n@DeuSCaNoN\nin\n#425\nadded creating qs from request body functionality + updated doc by\n@The-EDev\nin\n#442\nBlueprint middleware by\n@dranikpg\nin\n#403\nGeneric app constructor by\n@dranikpg\nin\n#408\nallow setting userdata in onaccept of websocket-connection by\n@MichaelSB\nin\n#447\nerase websocket::connection from vector in App::remove_websocket() by\n@MichaelSB\nin\n#450\ndo not try to read from websocket after sending and receiving the clo… by\n@MichaelSB\nin\n#452\nFix dead link (404) under Setting Up / Building. by\n@D7EAD\nin\n#459\nWebpage tutorial by\n@The-EDev\nin\n#451\nfix qs_parse eating first character in form keys by\n@aloussase\nin\n#464\nFix failing unittests in master and 1.0 by\n@erikaldsund\nin\n#467\nDeboostify Crow by\n@luca-schlecker\nin\n#457\nFix wvalue::operator = (wvalue && r); Number type loss problem by\n@wnself\nin\n#466\noverload template_t::render to accept context as an r-value by\n@aloussase\nin\n#465\nAdd error message to Websocket\nonerror\nhandler by\n@The-EDev\nin\n#476\nmove includes outside namespace crow by\n@MichaelSB\nin\n#479\nrework the way asio is handled as a dependency. by\n@luca-schlecker\nin\n#482\nonly allow regular files in set_static_file_info, return 404 in all o… by\n@MichaelSB\nin\n#470\nOptionally make use of Markdown 'warning' notation. by\n@D7EAD\nin\n#484\nFixed issue where an index in qs_parse is incorrectly incremented beyond the maximum possible value by\n@The-EDev\nin\n#486\nfix CrowConfig.cmake not being able to find Findasio.cmake module. by\n@luca-schlecker\nin\n#492\nFixed bug: Could not define route for HEAD method by\n@erikaldsund\nin\n#491\nAdd response constructor overload by\n@aloussase\nin\n#495\nAdded missing information and improved stylesheets for dark mode by\n@The-EDev\nin\n#496\nSessions Middleware by\n@dranikpg\nin\n#448\nget_part_by_name doesn't crash on nonexistent keys by\n@Iuliean\nin\n#501\nFix build warnings by\n@Phoenix-flame\nin\n#503\nSession fixes by\n@dranikpg\nin\n#505\nFind the route as soon as the URL is parsed by\n@The-EDev\nin\n#499\nAdd template/typename keywords to crow macros by\n@dranikpg\nin\n#508\nstatic directory slash fix by\n@The-EDev\nin\n#507\nFix compilation error: ambiguous overload by\n@erikaldsund\nin\n#513\nCpp17 filesystem usage fixes by\n@erikaldsund\nin\n#514\nFix merge_all.py by\n@deroskarmodulo\nin\n#518\ndocs(compression): Fix\nvcpkg.json\nreference by\n@ryanrussell\nin\n#522\nPrevent HTTP pipelining by\n@The-EDev\nin\n#524\nFix stack data disclosure when returning static files smaller than 16KiB by\n@mrozigor\nin\n#523\nAddress\n#534\n- handling missing mime types gracefully by\n@jake-arkinstall\nin\n#536\ndocs(middlewares): readability improvements by\n@ryanrussell\nin\n#540\nwebsocket: Reduce number of re-allocation of string parameters by\n@kang-sw\nin\n#535\nrefactor(websocket): readability improvements by\n@ryanrussell\nin\n#541\nFix websocket crash from connection pointer dangling by\n@kang-sw\nin\n#530\nfix post method. by\n@lag945\nin\n#550\nfeat(cmake): improved debian packaging by\n@okaestne\nin\n#553\nFix some valgrind reported issues by\n@okaestne\nin\n#560\nFix warnings generated by clang++ by\n@okaestne\nin\n#561\nFix use-after-move by\n@BoleynSu\nin\n#565\nFix 381 by\n@hlmodi\nin\n#566\nfix optimizeNode to prevent a crash on MSVC by\n@leksiso\nin\n#568\nAdapt CROW_WEBSOCKET_ROUTE to accept app reference by\n@soehrl\nin\n#556\nApply workaround for Apple to FreeBSD aswell by\n@puffetto\nin\n#578\nfix warning on non MS systems for using sprintf instead of snprintf by\n@gittiver\nin\n#580\n#585\n: Resolves issue with blueprint assignments. by\n@xia-stan\nin\n#590\nfix\n#587\nRender true and false Mustache tags by\n@queenstdev\nin\n#588\nGet server running port, bindaddr and threads by\n@xandross389\nin\n#592\nFix typo in unit test by\n@gfeyer\nin\n#595\nfix typos in app.md by\n@alex-lt-kong\nin\n#600\nFix loghandler memleak by @IldarKashaev in\n#609\nAdded possibility to return empty JSON object instead of NULL by\n@killoctal\nin\n#602\nadd github action for build and test by\n@gittiver\nin\n#586\nValidate if CROW_ROUTE starts with a '/' by\n@StefanoPetrilli\nin\n#597\nFixed compilation under android ndk, operator \"=\" was undefined by\n@marcrobm\nin\n#634\nFix memory leaks caused from the http_connection by\n@anagno\nin\n#633\nMinor updates to docs by\n@robertgodfrey\nin\n#646\nFix windows build and remove deprecated macOS10.15 builder in github action for build and test by\n@gittiver\nin\n#648\nAdded an example for uploading files by\n@kiner-shah\nin\n#638\nuse GNUInstallDirs for CMake installation by\n@topazus\nin\n#642\nAdded Coveralls to GitHub Actions by\n@The-EDev\nin\n#657\nadded const as in source by\n@gittiver\nin\n#659\nadded cmake options for feature ssl and compression and crow amalgamate for windows in gh-actions by\n@gittiver\nin\n#655\nAdd GitHub action for gh pages by\n@gittiver\nin\n#654\nadded proper coveralls submission workflow by\n@The-EDev\nin\n#662\nfix diverse compiler warnings by\n@gittiver\nin\n#656\nUpdate websocket example code, minor grammar fixes by\n@robertgodfrey\nin\n#670\nAdd missing const to mustache\nrender\nand\njson::wvalue::operator[]\nby\n@cschreib\nin\n#683\nUpdate MacOS setup guide by\n@waynegerard\nin\n#691\nPerformance fix for non-static streaming data by\n@jfmu\nin\n#728\nFix order of destructor call of io_service in crow::Server by\n@na-trium-144\nin\n#722\nfix build: android/termux/clang-17.0 by\n@keith-dev\nin\n#736\nenable CROW_FEATURES ssl, compression on all platforms by\n@gittiver\nin\n#678\nFix rejected request when receiving HTTP header \"Expect: 100-continue\" by\n@bruvey37\nin\n#727\nFix clang debug build (Android and FreeBSD) by\n@keith-dev\nin\n#740\nprepare release 1.1.0 on master-branch by adding new version to  documentation by\n@gittiver\nin\n#742\nNew Contributors\n@bryceschober\nmade their first contribution in\n#378\n@beached\nmade their first contribution in\n#383\n@hsiegmund\nmade their first contribution in\n#385\n@dhchen\nmade their first contribution in\n#404\n@danielskeenan\nmade their first contribution in\n#411\n@joelguittet\nmade their first contribution in\n#419\n@konradkar2\nmade their first contribution in\n#434\n@DeuSCaNoN\nmade their first contribution in\n#425\n@MichaelSB\nmade their first contribution in\n#447\n@D7EAD\nmade their first contribution in\n#459\n@aloussase\nmade their first contribution in\n#464\n@erikaldsund\nmade their first contribution in\n#467\n@wnself\nmade their first contribution in\n#466\n@Iuliean\nmade their first contribution in\n#501\n@Phoenix-flame\nmade their first contribution in\n#503\n@deroskarmodulo\nmade their first contribution in\n#518\n@ryanrussell\nmade their first contribution in\n#522\n@jake-arkinstall\nmade their first contribution in\n#536\n@kang-sw\nmade their first contribution in\n#535\n@lag945\nmade their first contribution in\n#550\n@okaestne\nmade their first contribution in\n#553\n@BoleynSu\nmade their first contribution in\n#565\n@hlmodi\nmade their first contribution in\n#566\n@leksiso\nmade their first contribution in\n#568\n@soehrl\nmade their first contribution in\n#556\n@puffetto\nmade their first contribution in\n#578\n@xia-stan\nmade their first contribution in\n#590\n@queenstdev\nmade their first contribution in\n#588\n@xandross389\nmade their first contribution in\n#592\n@gfeyer\nmade their first contribution in\n#595\n@alex-lt-kong\nmade their first contribution in\n#600\n@IldarKashaev made their first contribution in\n#609\n@killoctal\nmade their first contribution in\n#602\n@StefanoPetrilli\nmade their first contribution in\n#597\n@marcrobm\nmade their first contribution in\n#634\n@anagno\nmade their first contribution in\n#633\n@robertgodfrey\nmade their first contribution in\n#646\n@kiner-shah\nmade their first contribution in\n#638\n@topazus\nmade their first contribution in\n#642\n@cschreib\nmade their first contribution in\n#683\n@waynegerard\nmade their first contribution in\n#691\n@jfmu\nmade their first contribution in\n#728\n@na-trium-144\nmade their first contribution in\n#722\n@keith-dev\nmade their first contribution in\n#736\n@bruvey37\nmade their first contribution in\n#727\nFull Changelog\n:\nv1.0+5...v1.1.1",
        "crawl_status": "success"
      },
      {
        "library_name": "Crow",
        "url": "https://github.com/CrowCpp/Crow/releases/tag/v1.2.0",
        "version": "v1.2.0",
        "title": "Release v1.2.0 · CrowCpp/Crow · GitHub",
        "release_date": "2024-05-28T20:54:21Z",
        "content": "What's Changed\nThe release contains some fixes related to web sockets, a lot of small fixes and documentation improvements.\nFix\n#754\nby\n@bruvey37\nin\n#755\nfix: minimize the precision loss when dumping double to string by\n@junekhan\nin\n#712\nUse\nconst std::string&\nas argument to\nroute()\nby\n@cschreib\nin\n#684\nHandle _CROW_ILL or _CROW_ICD being NOTFOUND by\n@DavidPetkovsek\nin\n#720\nfix: call after_handlers for legitimate requests without body part by\n@junekhan\nin\n#771\nadd spdx license id to compiled header by\n@jdknight\nin\n#773\nCall middleware during upgrade request by\n@bruvey37\nin\n#763\nFixed some harmless typos. by\n@hporten\nin\n#776\nAllow multiple executions of\nvalidate()\n(\n#672\n) by\n@StefanoPetrilli\nin\n#676\nAdd configurable exception handler by\n@cschreib\nin\n#637\nAdd indentation to json dump method by\n@sina-rostami\nin\n#748\nfix: parse body when unsupported HTTP/2 upgrade is requested by\n@t-cadet\nin\n#783\nfix: compilation error with libc++ by\n@ItsAlbertZhang\nin\n#784\nAdd HTTP status 406 by\n@ssams\nin\n#798\nAdd option to use Boost.Asio by\n@bugdea1er\nin\n#790\nHeader files documentation by @Nabzokek in\n#804\nGet rid of unnecessary string copies in the the keys() method by\n@AndreyTokmakov\nin\n#800\nNew Contributors\n@junekhan\nmade their first contribution in\n#712\n@DavidPetkovsek\nmade their first contribution in\n#720\n@jdknight\nmade their first contribution in\n#773\n@hporten\nmade their first contribution in\n#776\n@sina-rostami\nmade their first contribution in\n#748\n@t-cadet\nmade their first contribution in\n#783\n@ItsAlbertZhang\nmade their first contribution in\n#784\n@ssams\nmade their first contribution in\n#798\n@bugdea1er\nmade their first contribution in\n#790\n@Nabzokek made their first contribution in\n#804\n@AndreyTokmakov\nmade their first contribution in\n#800\nFull Changelog\n:\nv1.1.0...v1.2.0",
        "crawl_status": "success"
      },
      {
        "library_name": "Crow",
        "url": "https://github.com/CrowCpp/Crow/releases/tag/v1.3.0",
        "version": "v1.3.0",
        "title": "Release v1.3.0 · CrowCpp/Crow · GitHub",
        "release_date": "2025-10-13T14:50:57Z",
        "content": "What's Changed\nAdd unix domain socket support by\n@na-trium-144\nin\n#803\nThe most important change in this release is support for unix domain sockets as server sockets.\nAdds SBOM generation using cmake-sbom by\n@StefanoPetrilli\nin\n#1066\nThe CMake build scripts supports now the generation of an SBOM, there is a new CMake option CROW_GENERATE_SBOM for this.\nA lot of outstanding small bugs was fixed, the most important are maybe these:\nFix \"load balancing\" not working by\n@ino-josh\nin\n#1050\nfix for catch all route does not get fully parsed request by\n@gittiver\nin\n#1076\n@StefanoPetrilli\noverhauled the GitHub CI scripts, we build now with Boost::asio, standalone asio, clang or gcc, libstdc++ or libc++.\nA lot of other small fixes and improvements were done by the community of contributors:\nFix for middleware using unsteady clock by\n@finn-nerd\nin\n#999\nSynchronious write stream handling fix by\n@TiARETiK\nin\n#1000\nBumped the minimum C++ version from 11 to 17 in docs by\n@Guiorgy\nin\n#1001\nUpdate minimum ASIO version requirement in getting started documentation by\n@HiGuyJanni\nin\n#1008\nFix deprecated literal operator warning in Clang 20 by\n@HiGuyJanni\nin\n#1015\nOmit Server header when server_name is empty by\n@Sightem\nin\n#1021\n[doc] Default CMake Build Requires Linking Against OpenSSL and Zlib by\n@jameshu15869\nin\n#1030\nFIX: \"bind: Address already in use\" by\n@nyaruku\nin\n#1028\nLog invalid port (fixes\n#952\n) by\n@HiGuyJanni\nin\n#1037\ncorrected minimal asio version for deprecated functions by\n@gittiver\nin\n#1039\nAdd new template project with Docker support out of the box by\n@landiluigi746\nin\n#1041\n[SSL_MD] ADDED fullchain certificate usage in ssl.md by\n@OBEsensia\nin\n#1044\nAdding bazelmod by\n@sebastianbergt\nin\n#1009\nClean up: Relocate Method to HTTP server by\n@EmBachlitzanakis\nin\n#1049\nUpdate socket_adaptors.h by\n@marcuradu2\nin\n#1051\nCompiler warning fixes by\n@gittiver\nin\n#870\nUse error_code from correct namespace by\n@hpcdgrie\nin\n#1055\nlogger optimisation by\n@gittiver\nin\n#1056\nupdate OSS-Fuzz build script by\n@AdamKorcz\nin\n#1063\nAdd is_bound() helper for checking server bind state by\n@maredman\nin\n#1065\nSolves compilation error when using Boost by\n@StefanoPetrilli\nin\n#1070\nAdds Boost to ci by\n@StefanoPetrilli\nin\n#1071\nDocumentation Dark Mode Font/Background (Issue\n#695\n) by\n@Adrian1161\nin\n#1073\nadded star history diagram by\n@gittiver\nin\n#1072\nRefactors Build and Test CI by\n@StefanoPetrilli\nin\n#1079\ninclude CPM via CMAKE_CURRENT_SOURCE_DIR by\n@aumuell\nin\n#1083\nFix Boost::system search for 1.89 and later by\n@IgnatSergeev\nin\n#1082\nAdd option to search for boost if enabled by\n@bmarques1995\nin\n#1085\nAdd content type to set static file info by\n@mketas\nin\n#1086\nSolves websocket memory leak by\n@StefanoPetrilli\nin\n#1080\nIsolate utility tests by\n@nicholashanson\nin\n#1090\nRefactor routing_params test and isolate HTTP response tests by\n@nicholashanson\nin\n#1088\nFix a regression on MacOS by\n@puffetto\nin\n#1095\nAdd missing include to http_server.h by\n@beached\nin\n#1094\nRefactor/isolate json tests by\n@nicholashanson\nin\n#1092\nRefactor/isolate websocket tests by\n@nicholashanson\nin\n#1091\nRefactor/isolate mustache tests by\n@nicholashanson\nin\n#1093\nurl_display: correctly display v6 addresses by\n@autoantwort\nin\n#1096\nadd nsis install step by\n@gittiver\nin\n#1102\ngitignore: Add macOS files and more files from QtCreator by\n@autoantwort\nin\n#1100\nadded test for issue\n#1042\nby\n@gittiver\nin\n#1061\nNew Contributors\n@finn-nerd\nmade their first contribution in\n#999\n@Guiorgy\nmade their first contribution in\n#1001\n@HiGuyJanni\nmade their first contribution in\n#1008\n@Sightem\nmade their first contribution in\n#1021\n@jameshu15869\nmade their first contribution in\n#1030\n@nyaruku\nmade their first contribution in\n#1028\n@landiluigi746\nmade their first contribution in\n#1041\n@OBEsensia\nmade their first contribution in\n#1044\n@sebastianbergt\nmade their first contribution in\n#1009\n@ino-josh\nmade their first contribution in\n#1050\n@EmBachlitzanakis\nmade their first contribution in\n#1049\n@marcuradu2\nmade their first contribution in\n#1051\n@hpcdgrie\nmade their first contribution in\n#1055\n@AdamKorcz\nmade their first contribution in\n#1063\n@maredman\nmade their first contribution in\n#1065\n@Adrian1161\nmade their first contribution in\n#1073\n@aumuell\nmade their first contribution in\n#1083\n@IgnatSergeev\nmade their first contribution in\n#1082\n@bmarques1995\nmade their first contribution in\n#1085\n@mketas\nmade their first contribution in\n#1086\n@nicholashanson\nmade their first contribution in\n#1090\nFull Changelog\n:\nv1.2.1.2...v1.3.0",
        "crawl_status": "success"
      }
    ],
    "expected_years": [
      2024,
      2025,
      2023
    ],
    "actual_years": [
      2024,
      2025
    ],
    "years_extracted": [
      2024,
      2024,
      2025
    ],
    "reason": "年份分布不符合要求（2023、2024、2025各一个）"
  }
]