[
  {
    "library_name": "dagger",
    "url": "https://github.com/google/dagger/releases/tag/dagger-2.53",
    "version": "dagger-2.53",
    "title": "Release Dagger 2.53 · google/dagger · GitHub",
    "release_date": "2024-12-02T22:22:44Z",
    "content": "Potentially breaking changes:\n@Binds\nmethods now requires explicit nullability\nNew:\n@Binds\nmethods must explicitly declare nullability (previously we tried to infer it from\nthe parameter). This change aligns the nullability behavior of\n@Binds\nwith how nullability is\ntreated elsewhere in Dagger by requiring it to be explict at the request and declaration sites.\n(\n4941926\n)\nSuggested fix:\nIf you get a failure due to this change, add the proper nullability to your\n@Binds\nmethod/parameter. For example:\n@Module\ninterface MyModule {\n-\n@Binds fun bindToNullableImpl(impl: FooImpl): Foo\n+\n@Binds fun bindToNullableImpl(impl: FooImpl?): Foo?\n}\nScopes are now banned on\n@Binds\nthat delegate to production implementations.\nNew:\nScoping an\n@Binds\nmethod that delegates to an\n@Produces\nimplementation is not\nallowed. The scope was ignored anyway because production bindings are implicitly scoped. (\n03b237f\n)\nSuggested fix:\nRemove the scope annotation (since the scope was ignored, this should not be a functional change).\n@Module\ninterface MyModule {\n-\n@ProductionScoped\n@Binds fun bindToProductionImpl(impl: FooImpl): Foo\n}\n@JvmSuppressWildcards\nnow required on multibound map requests in KSP.\nNew:\nWhen requesting a multibound map, users must include\n@JvmSuppressWildcards\non the\nmap's value, e.g.\nMap<K, @JvmSuppressWildcards V>\n. Note that this has always been the behavior\nin KAPT, but due to a bug in the KSP implementation we accidentally matched the request without\n@JvmSuppressWildcards\n.\nSuggested fix:\nUnfortunately, this means users may need to add back\n@JvmSuppressWildcards\nfor multibound map requests. At the moment, KSP doesn't provide a way to determine the Kotlin type\nis actually assignable to\nMap<K, V>\nwithout\n@JvmSuppressWildcards\nat compile time, and without\nthis check users could hit runtime failures when Dagger tries to cast the type to the users type.\nclass MyClass\n@Inject constructor(\n-\nmultiboundMap: Map<K, V>\n+\nmultiboundMap: Map<K, @JvmSuppressWildcards V>\n)\nIn the future, we may consider simple cases where we can guarantee that\n@JvmSuppressWildcards\ncan\nbe elided, but that is out of scope for this release.\nRemove support for Java 7\nNew:\nDagger has officially removed support for Java 7. Oracle ended support for Java 7 in\nJuly 2022, and since Dagger has upgraded to JDK 18, compiling with language level 7 is no longer\nsupported. Note that this may not break users immediately since Dagger's generated code is still\ntechnically Java 7 compatible.\nSuggested Fix:\nUpgrade to Java 8+ (While Dagger can still test Java 8 at the moment, it is\nalso deprecated as of January 2024, and we'll likely need to remove support soon).\nOther changes\nMerge pull request\n#4459\n:  Permit\n@Multibinds\nwith values\nthat are also allowed by\n@IntoSet\n/\n@IntoMap\n. (\n0f936b5\n)\nRestrict multibindings from providing framework types that conflict with multibinding types\nDagger provides (e.g.\n@Provides @IntoMap Provider<String>\n). This is technically a breaking\nchange but existing issues should either be for unused code or code that should have already\nbroken anyway. (\n15a30ca\n)\nRemove the\nignorePrivateAndStaticInjectionForComponent\ncompiler option.\nThis compiler option is only intended for internal testing of the tck tests, and should not be\nused by clients. (\ndfcdc9c\n)\nUpgrade Hilt Gradle Plugin min AGP version to 8.1 (\n18d2b26\n)\nUpgrade Kotlin Metadata dependency to 2.0.0-Beta5 (\n9a94d19\n)\nFixes\n#4391\n: Fix gwt issue (\naf62f2d\n)\nAdd GWT dependencies for Jakarta Inject (\nbea926c\n)",
    "crawl_status": "success"
  },
  {
    "library_name": "dagger",
    "url": "https://github.com/google/dagger/releases/tag/dagger-2.57.1",
    "version": "dagger-2.57.1",
    "title": "Release Dagger 2.57.1 · google/dagger · GitHub",
    "release_date": "2025-08-20T21:16:54Z",
    "content": "Bug fixes\nFixes\n#4734\n: Updated Hilt's Gradle Plugin detection of AGP to maximize compatibility and avoid the confusing 'The Hilt Android Gradle plugin can only be applied to an Android project.' error when the plugin is on an Android project. (\n20adecb\n)\nFixes\n#4848\n: Set coreLibrariesVersion for the Kotlin compilation of the Hilt Gradle Plugin to further improve backwards compatibility. (\n00c7fc2\n)\nFixes\n#4848\n: Use api / language versions for the Kotlin compilation of the Hilt Gradle Plugin to not force projects to update to Kotlin 2.2.0, the current version used by the plugin. (\n58e4992\n)\nFixes\n#4780\n: Add support for the Jakarta Singleton annotation in Hilt. (\nec7f76f\n)\nFixes\n#4917\n: Removes the explicit dependency to androidx.annotation:annotation-jvm and to a beta version of it. (\n092a85a\n)\nLimit number of similar bindings shown in error messages to 20 (\n59ac2f9\n)\nUpdate wording for @AssistedInject error to be more specific. (\n1702e79\n)",
    "crawl_status": "success"
  },
  {
    "library_name": "dagger",
    "url": "https://github.com/google/dagger/releases/tag/dagger-2.48",
    "version": "dagger-2.48",
    "title": "Release Dagger 2.48 · google/dagger · GitHub",
    "release_date": "2023-08-30T16:28:08Z",
    "content": "Dagger 2.48\nDagger/Hilt KSP support\nDagger 2.48 includes the alpha release of the Dagger and Hilt KSP processors.\nInstructions for using the Dagger/Hilt KSP processors can be found at\nhttps://dagger.dev/dev-guide/ksp\n.\nIn order to use Dagger’s KSP processor you will need to:\nFollow the basic setup to migrate Dagger’s processors from\nkapt\nto\nksp\n(see\nhttps://dagger.dev/dev-guide/ksp#setup\n).\nMigrate any\nDagger SPI plugins\nto the new Dagger SPI plugins API (with KSP support) (see\nhttps://dagger.dev/dev-guide/ksp#new-dagger-spi-plugin-with-ksp-support\n).\nEnsure that there are no\nkapt\nprocessors that generate classes that need to interact with Dagger (see\nhttps://dagger.dev/dev-guide/ksp#interaction-with-javackapt-processors\n).\nIf you depend on\nandroidx.hilt:hilt-common\nor\nandroidx.hilt:hilt-work\nthey will need to be updated to at least\n1.1.0-alpha01\n.\nAlso note that Dagger’s KSP processors are still in the alpha stage. So far we’ve focused mainly on trying to ensure correctness rather than optimize performance. Please apply due diligence when enabling\nksp\nand report any bugs or performance issues at\nhttps://github.com/google/dagger/issues\n. The current list of known issues can be found\nhere\n.\nThere are also a few potentially breaking changes included with this release. These changes were made to better support Dagger usage with Kotlin sources, and make the migration from KAPT to KSP more seamless. We don’t expect these changes to affect most users. Please see below for more details.\nBreaking changes\nThe\ndagger.ignoreProvisionKeyWildcards\nis now enabled by default\nThis may break apps that are providing the same binding with different wildcards, e.g.\nFoo<Bar>\nand\nFoo<? extends Bar>\n.\nFix: See\nhttps://dagger.dev/dev-guide/compiler-options#ignore-provision-key-wildcards\nfor suggestions on how to fix this. If fixing is not an immediate option, you can still disable the flag with\ndagger.ignoreProvisionKeyWildcards=DISABLED\n.\n@Binds\nassignability check\nUnlike KAPT, KSP takes nullability into account when checking if a type is assignable to another type. This changes the behavior of Dagger’s\n@Binds\nusage validation such that a type that was assignable in KAPT may no longer be assignable in KSP. For example:\n//\nIncorrect: this compiles successfully in KAPT but the compilation fails in KSP\n@Binds\nfun\nbind\n(\nimpl\n:\nFooImpl\n<\nBar\n?>):\nFoo\n<\nBar\n>\nFix: To fix this breakage, users should update the parameter or return type in the method such that they are actually assignable when taking nullability into account. For example:\n//\nCorrect: this compiles successfully in KAPT and KSP\n@Binds\nfun\nbind\n(\nimpl\n:\nFooImpl\n<\nBar\n?>):\nFoo\n<\nBar\n?>\nTop-level\n@Module\n/\n@Inject\nclasses can no longer be private\nTop-level\n@Module\nor\n@Inject\nclasses can no longer be private. This was previously allowed purely by accident (rather than being an officially supported feature) due to the way Kotlin’s private classes are represented as package-private in KAPT’s generated java stubs.\nFix: Replace the\nprivate\nvisibility modifier with\ninternal\nor\npublic\n.\n@Binds\nand\n@Provides\nmethods can no longer be extension functions\nNormally when we define an\n@Provides\n/\n@Binds\nfunction  we put the dependencies in the parameter list:\n@Module\nabstract class BarModule {\n    @Binds\n    abstract fun bindsBar(@Marker foo: Foo): Bar\n}\nHowever, since the introduction of KAPT, it was also technically possible to define an\n@Provides\n/\n@Binds\nfunction using an extension function:\n@Module\nabstract class BarModule {\n    @Binds\n    abstract fun @receiver:Marker Foo.bindsBar(): Bar\n}\nThis extension function syntax worked more by coincidence (rather than being an officially supported feature) due to the way extension functions are represented in KAPT’s generated java stubs. After review, we’ve decided not to support this feature anymore in KAPT or KSP. See more at\n#3990\n.\nFix: Use the traditional parameter approach rather than extension functions.\nThe use of\nabstract var\nproperties are no longer allowed in components\nA\nvar\nproperty adds both a getter (aka request) method and a setter (aka injection) method for a binding. However, the setter method typically goes unused since there is rarely a case for needing both methods for a single binding. After discussion within the team, we’ve decided to ban\nabstract var\nproperties in components.\nFix: Use\nfun\n(or\nval\n) for getter methods, use\nfun\nfor setter methods.\nOther changes\nFixed\n#3995\n: Allow kotlin source to use java keywords as parameter names in KSP (\n2c31d66\n).\nFixed\n#3991\n: Fixed error message when there are multiple\n@Inject\n+\n@AssistedInject\nconstructors (9105ee671).\nFixed\n#3992\n: Fixed crash crash when there are multiple\n@AssistedInject\n+\n@AssistedInject\nconstructors (9105ee671.)\nAdd a better error message when Hilt Gradle Plugin class loader conflicts with KSP's Gradle plugin. (\n3f7b9b5\n)",
    "crawl_status": "success"
  }
]